      /COPY QILEGEN,£DECDS

     C     *ENTRY        PLIST
     C                   PARM                    £DECCD
     C                   PARM                    £DECTP
     C                   PARM                    £DECPA
     C                   PARM                    £DECR1
     C                   PARM                    £DECR2
     C                   PARM                    £DECDE
     C                   PARM                    £DECIN
     C                   PARM                    £DEC35
     C                   PARM                    £DEC36
     C                   PARM                    £DECAM
     C                   PARM                    £DECCO
     C                   PARM                    £DECDT
     C                   PARM                    £DECDI
     C                   PARM                    £DECDO