      /COPY QILEGEN,£OAVDS
     C     *ENTRY        PLIST
     C                   PARM                    £OAVFU
     C                   PARM                    £OAVME
     C                   PARM                    £OAVT1
     C                   PARM                    £OAVP1
     C                   PARM                    £OAVC1
     C                   PARM                    £OAVT2
     C                   PARM                    £OAVP2
     C                   PARM                    £OAVC2
     C                   PARM                    £OAVAT
     C                   PARM                    £OAVDA
     C                   PARM                    £OAVOV
     C                   PARM                    £OAVON
     C                   PARM                    £OAVOD
     C                   PARM                    £OAVOA
     C                   PARM                    £OAVOT
     C                   PARM                    £OAVOP
     C                   PARM                    £OAVCT
     C                   PARM                    £OAVLI
     C                   PARM                    £OAVDV
     C                   PARM                    £OAVIN
     C                   PARM                    £OAVSI
     C                   PARM                    £OAVM1
     C                   PARM                    £OAVM2
     C                   PARM                    £OAVMS
     C                   PARM                    £OAVFI
     C                   PARM                    £OAVCM
     C                   PARM                    £OAV35
     C                   PARM                    £OAV36
     C                   PARM                    £OAVDI
     C                   PARM                    £OAVDO