      * This program has the sole purpose of throwing a runtime exception
     D $A              S              2    DIM(10)
     D $B              S              2
     D $C              S              2
     C                   EVAL      $C=$A($B)
