     FMULANGTL  UF A E           K DISK
     C     KERR          KLIST
     C                   KFLD                    MLSYST
     C                   KFLD                    MLTIPO
     C                   KFLD                    MLPROG
     C     KERR          CHAIN     MULANGTL
     C     MLNNAT        DSPLY