     D £DBG_Str        S             2
     FB£LOGE0F  O    E             DISK    USROPN

     D §§DEOA          S                   LIKE(B§DEOA)

     C                   EVAL      £DBG_Str='ok'
     C     £DBG_Str      DSPLY