     D £DBG_Str        S             2

     D $OavFU          S                   Like(£OavFU)
     D $OavME          S                   Like(£OavME)
     D §OavFU          S                   Like(£OavFU)
     D §OavME          S                   Like(£OavME)

     C     *ENTRY        PLIST
     C                   PARM                    £OAVFU           10            Funzione
     C                   PARM                    £OAVME           10            Metodo

     C                   EVAL      £DBG_Str='ok'
     C     £DBG_Str      DSPLY