     V* ==============================================================
     V* 05/12/2024 APU001 Creation
     V* ==============================================================
    O * PROGRAM GOAL
    O * This program is used by 'MUDRNRAPU00177' for its purpose.
     V* ==============================================================
     D PARM1           S              3    INZ('AUX')
     D RESULT          S              3

     C     'CALLED'      DSPLY
     C     PARM1         DSPLY
     C     RESULT        DSPLY
     C                   SETON                                        RT

     C     *INZSR        BEGSR
     C     *ENTRY        PLIST
     C     PARM1         PARM                    RESULT
     C                   ENDSR