     FJALOGT0F  UF A E             DISK    USROPN
     DJALOGT         E DS                  EXTNAME(JALOGT0F)
     DSJALOG           S                   LIKE(JALOGT)

     C                   EVAL      SJALOG=JALOGT