     D £UIBDS          DS            10
     D £UIBME                          0
     DXUIBME           S                   LIKE(£UIBME)
     C                   MOVEL(P)  £UIBME        XUIBME