     V* ==============================================================
     V* 27/06/2025 APU002 Creation
     V* ==============================================================
    O * PROGRAM GOAL
    O * Packed numbers in floating point notation from DB
     V* ==============================================================
    O * JARIKO ANOMALY
    O * Before the fix, Jariko could not interpret the number
     V* ==============================================================
     FMULANGTL  UF A E           K DISK
     C     KERR          KLIST
     C                   KFLD                    MLSYST
     C                   KFLD                    MLTIPO
     C                   KFLD                    MLPROG
     C     KERR          CHAIN     MULANGTL
     C     MLNNAT        DSPLY
