     D £DBG_Str        S             2
     D SRIG_PTR        S               *   Inz(*Null)
     C                   EVAL      SRIG_PTR = *NULL
     C                   EVAL      £DBG_Str='ok'
     C     £DBG_Str      DSPLY