     V* ==============================================================
     V* 05/12/2024 APU002 Creation
     V* ==============================================================
    O * PROGRAM GOAL
    O * Unary expression with '+' symbol
     V* ==============================================================
    O * JARIKO ANOMALY
    O * Before the fix, jariko throw a syntax error
     V* ==============================================================
     D$A               S              2  0
     C                   EVAL      $A=+1
     C     $A            DSPLY