     D FOO             S                   LIKE(£DECCD)

      /API QILEGEN,£DEC

     C                   EVAL      FOO = 'HELLO THERE'
     C     FOO           DSPLY
