     D £DBG_Str        S             2
     C                   Z-ADD     UDATE         UDATE1            4 0
     C                   Z-ADD     UYEAR         UYEAR1            4 0
     C                   Z-ADD     UMONTH        UMONTH1           4 0
     C                   Z-ADD     UDAY          UDAY1             4 0

     C                   EVAL      £DBG_Str='ok'
     C     £DBG_Str      DSPLY