     V* ==============================================================
     V* 03/12/2024 APU002 Creation
     V* ==============================================================
    O * PROGRAM GOAL
    O * SELECT operation containing only a OTHER branch
     V* ==============================================================
    O * JARIKO ANOMALY
    O * Before the fix, jariko throw a syntax error
     V* ==============================================================
     C                   SELECT
     C                   OTHER
     C     'ok'          DSPLY
     C                   ENDSL