     V* ==============================================================
     V* 02/12/2024 APU001 Creation
     V* ==============================================================
    O * PROGRAM GOAL
    O * This program is used by 'MUDRNRAPU00174' for its purpose.
     V* ==============================================================
     D PARM1           S              3    INZ(*BLANKS)
     D PARM2           S              3    INZ(*BLANKS)

     C                   EVAL      PARM2='BAR'
     C                   EVAL      RES='123'
     C                   SETON                                        RT



     C     *INZSR        BEGSR
     C     *ENTRY        PLIST
     C     PARM1         PARM      PARM2         RES               3
     C                   ENDSR