     D SDECT1          S                   LIKE(£DECTP)

     C/API QILEGEN,CALLDEC
     C                   EVAL   SDECT1 = 'ok'
     C     SDECT1        DSPLY
