     D £DBG_Str        S             2
     FB£G40EWK  IF   E           K DISK    USROPN
     C                   CLOSE     B£G40EWK
     C                   EVAL      £DBG_Str='ok'
     C     £DBG_Str      DSPLY