     D £DBG_Str        S             2
     H DECEDIT(*JOBRUN) DATEDIT(*DMY/) DFTACTGRP(*NO) ACTGRP(*CALLER)
     H OPTION(*NODEBUGIO:*SRCSTMT:*NOUNREF) CCSID(*CHAR : *JOBRUN) DEBUG(*INPUT)
     C                   EVAL      £DBG_Str='ok'
     C     £DBG_Str      DSPLY