      * DOWxx with indicator in factor 1 should work as expected
     C     *IN35         DOWEQ     *OFF
     C                   EVAL *IN35 = *ON
     C                   ENDDO

      * Test output
     C     *IN35         DSPLY