     D £UIBDS          DS            10
     D £UIBME                          0   INZ('test')
     D XUIBME                          0   INZ('')

     DXUIBME           S                   LIKE(£UIBME)
     C                   MOVEL(P)  £UIBME        XUIBME
     C     XUIBME        DSPLY
     C     £UIBME        DSPLY