     D £DBG_Str        S             2

     D OlCod           S                   LIKE(£DECCD) INZ(*HIVAL)
      /API QILEGEN,£DEC

     C                   EVAL      £DBG_Str='ok'
     C     £DBG_Str      DSPLY