     D £DBG_Str        S             2
     C                   IF        0
     C                   EXCEPT    E1RIGA
     C                   ENDIF
     C                   EVAL      £DBG_Str='ok'
     C     £DBG_Str      DSPLY