     D £DBG_Str        S             2

     D AUTOAP        E DS                  EXTNAME(AUTOAP0F)
     D  AU1                   61     80         DIM(10)

     C                   EVAL      £DBG_Str='ok'
     C     £DBG_Str      DSPLY