     D £DBG_Str        S             2
     D STR132          S            132
     FPRT132    O    F  132        PRINTER OFLIND(*INOG) USROPN
     OPRT132    E            RIGA        1
     O                       STR132
     C                   EVAL      £DBG_Str='ok'
     C     £DBG_Str      DSPLY