     V* ==============================================================
     V* 22/11/2024 APU001 Creation
     V* ==============================================================
    O * PROGRAM GOAL
    O * This program is used by 'MUDRNRAPU00172' for its purpose.
     V* ==============================================================
     C     'Sub program' DSPLY
     C                   SETON                                          35
     C                   SETON                                        RT



     C     *INZSR        BEGSR
     C     *ENTRY        PLIST
     C                   PARM      *IN35         ££35              1
     C                   ENDSR
