      * Test declarations
     FMULANGTL  UF A E           K DISK
     C     KERR          KLIST
     C                   KFLD                    MLSYST
     C                   KFLD                    MLTIPO
     C                   KFLD                    MLPROG

      * Numbers from DB files should be correctly interpreted as numeric packed values
     C     KERR          CHAIN     MULANGTL

      * Test output
     C     MLNNAT        DSPLY