     D £DBG_Str        S             2
     D CSDS            DS
     D  NUM                           3S 0
     D  BOOL                           N 0
     D  STR                                LIKE(£DBG_Str)
     D  NUM2                          5S 0

     D OUT             S                   LIKE(CSDS) INZ(*HIVAL)
     C     OUT           DSPLY