     D £DBG_Str        S             2

     D£K11SO           S               A   VARYING LEN(16773100)
     D RESPONSE        S           5000    VARYING
     C                   EVAL      RESPONSE=£K11SO

     C                   EVAL      £DBG_Str='ok'
     C     £DBG_Str      DSPLY