      * Test declarations
     D RESULT          S              3  0

     C                   EVAL      RESULT = %DEC('123.4':3:0)

      * Test output
     C     RESULT        DSPLY