     V* ==============================================================
     V* 01/04/2025 APU001 Creation
     V* ==============================================================
    O * PROGRAM GOAL
    O * This program is used by 'MUDRNRAPU001107_P' for its purpose.
     V* ==============================================================
     D VAR_PARM        S              3

     C     VAR_PARM      DSPLY
     C                   SETON                                          LR

     C     *INZSR        BEGSR
     C     *ENTRY        PLIST
     C                   PARM                    VAR_PARM          3
     C                   ENDSR
