     D £DBG_Str        S             2

     C     ' '           CHECK     £G62I         £G62PI            2 0
     C     ' '           CHECKR    £G62I         £G62PF            2 0
     C     £G62PF        SUB       £G62PI        £G62LS            2 0
     C                   MOVEL     £G62I         £G62I            15
     C                   EVAL      £DBG_Str='ok'
     C     £DBG_Str      DSPLY