     D ut              S             30  0
     D dt              S               Z   INZ(Z'2024-07-10-10.25.27.921456')
     D t               S               Z   INZ(Z'1970-01-01-00.00.00.000000')

     C                   EVAL      ut=%diff(dt:t:*mseconds)
     C     ut            DSPLY
     C                   EVAL      ut=%diff(dt:t:*ms)
     C     ut            DSPLY
     C                   EVAL      ut=%diff(dt:t:*seconds)
     C     ut            DSPLY
     C                   EVAL      ut=%diff(dt:t:*s)
     C     ut            DSPLY
     C                   EVAL      ut=%diff(dt:t:*minutes)
     C     ut            DSPLY
     C                   EVAL      ut=%diff(dt:t:*mn)
     C     ut            DSPLY
     C                   EVAL      ut=%diff(dt:t:*hours)
     C     ut            DSPLY
     C                   EVAL      ut=%diff(dt:t:*h)
     C     ut            DSPLY
     C                   EVAL      ut=%diff(dt:t:*days)
     C     ut            DSPLY
     C                   EVAL      ut=%diff(dt:t:*d)
     C     ut            DSPLY
     C                   EVAL      ut=%diff(dt:t:*months)
     C     ut            DSPLY
     C                   EVAL      ut=%diff(dt:t:*m)
     C     ut            DSPLY
     C                   EVAL      ut=%diff(dt:t:*years)
     C     ut            DSPLY
     C                   EVAL      ut=%diff(dt:t:*y)
     C     ut            DSPLY
