     C     *ENTRY        PLIST
     C                   PARM                    §G4035            1

     C                   MOVEL     *OFF          §G4035
     C     §G4035        DSPLY