     D £DBG_Str        S             10
     DCQNCOG         E DS                  EXTNAME(CQNCOG0F) INZ
      *
     DK§CF             DS
     D K_N§TINC                            LIKE(N§TINC)
      *
     C                   EVAL      K_N§TINC='£C5'
     C     K_N§TINC      DSPLY
      *
     C                   SETON                                          LR