     D £DBG_Str        S            150          VARYING
     D A30_SEC         S             15  5

     C                   EVAL      A30_SEC=219120.38
     C                   EVAL      A30_SEC=%INTH(A30_SEC)
     C                   EVAL      £DBG_Str=%CHAR(A30_SEC)

     C     £DBG_Str      DSPLY