     D A10_PR01        PR            25A
     D £DBG_Str        S             50          VARYING

     C                   EVAL      £DBG_Str=A10_PR01
     C     £DBG_Str      DSPLY

     P A10_PR01        B
     D A10_PR01        PI            25A
     C                   RETURN    'Ritorno_Procedura'
     P A10_PR01        E