      *----------------------------------------------------------------------
     D A               S              2  0
     D B               S              2  0
     D SUM             S              2  0
      *----------------------------------------------------------------------
     C     *ENTRY        PLIST
     C                   PARM                    A
     C                   PARM                    B
     C                   PARM                    SUM
      *----------------------------------------------------------------------
     C                   EVAL      SUM = A + B
     C*     SUM           DSPLY
     C                   SETON                                        LR
      *----------------------------------------------------------------------
