     D VARSTD          S              2

     C     'CALLED'      DSPLY
     C     VARSTD        DSPLY
     C                   SETON                                        LR

     C     *ENTRY        PLIST
     C                   PARM                    VARSTD