     D £G90DS          DS           512
     D £G90WK          S            512

     C     'CALLED'      DSPLY
     C                   SETON                                        LR

     C     *ENTRY        PLIST
     C     £G90DS        PARM      £G90DS        £G90WK