     V* ==============================================================
     V* 24/11/2024 APU001 Creation
     V* ==============================================================
    O * PROGRAM GOAL
    O * In this test we have only File declaration. The fields are
    O *  placed on root.
    O * The purpose of test is to check File field resolution.
     V* ==============================================================
     FST01      IF   E           K DISK

     C                   SETON                                          LR