     V* ==============================================================
     V* 27/11/2024 APU001 Creation
     V* ==============================================================
    O * PROGRAM GOAL
    O * This test measures the execution time required to perform
    O *  repeated lookups of standalone fields and data structure
    O *  fields in a symbol table created from an Abstract
    O *  Syntax Tree (AST).
    O * It verifies that the AST can be produced successfully and
    O *  evaluates the performance of symbol table lookups for
    O *  specific fields.
    O * The goal is to evaluate the efficiency of symbol table lookups
    O *  and ensure performance is within an acceptable range.
     V* ==============================================================
     D VAR1            S             10
     D DS1             DS
     D  DS1_FLD1                     50
     D  DS1_FLD2                     50
     D  DS1_FLD3                     50
     D  DS1_FLD4                     50
     D  DS1_FLD5                     50
     D  DS1_FLD6                     50
     D  DS1_FLD7                     50
     D  DS1_FLD8                     50
     D  DS1_FLD9                     50
     D  DS1_FLD10                    50
     D  DS1_FLD11                    50
     D  DS1_FLD12                    50
     D  DS1_FLD13                    50
     D  DS1_FLD14                    50
     D  DS1_FLD15                    50
     D  DS1_FLD16                    50
     D  DS1_FLD17                    50
     D  DS1_FLD18                    50
     D  DS1_FLD19                    50
     D  DS1_FLD20                    50
     D  DS1_FLD21                    50
     D  DS1_FLD22                    50
     D  DS1_FLD23                    50
     D  DS1_FLD24                    50
     D  DS1_FLD25                    50
     D  DS1_FLD26                    50
     D  DS1_FLD27                    50
     D  DS1_FLD28                    50
     D  DS1_FLD29                    50
     D  DS1_FLD30                    50
     D  DS1_FLD31                    50
     D  DS1_FLD32                    50
     D  DS1_FLD33                    50
     D  DS1_FLD34                    50
     D  DS1_FLD35                    50
     D  DS1_FLD36                    50
     D  DS1_FLD37                    50
     D  DS1_FLD38                    50
     D  DS1_FLD39                    50
     D  DS1_FLD40                    50
     D  DS1_FLD41                    50
     D  DS1_FLD42                    50
     D  DS1_FLD43                    50
     D  DS1_FLD44                    50
     D  DS1_FLD45                    50
     D  DS1_FLD46                    50
     D  DS1_FLD47                    50
     D  DS1_FLD48                    50
     D  DS1_FLD49                    50
     D  DS1_FLD50                    50

     D DS2             DS
     D  DS2_FLD1                     50
     D  DS2_FLD2                     50
     D  DS2_FLD3                     50
     D  DS2_FLD4                     50
     D  DS2_FLD5                     50
     D  DS2_FLD6                     50
     D  DS2_FLD7                     50
     D  DS2_FLD8                     50
     D  DS2_FLD9                     50
     D  DS2_FLD10                    50
     D  DS2_FLD11                    50
     D  DS2_FLD12                    50
     D  DS2_FLD13                    50
     D  DS2_FLD14                    50
     D  DS2_FLD15                    50
     D  DS2_FLD16                    50
     D  DS2_FLD17                    50
     D  DS2_FLD18                    50
     D  DS2_FLD19                    50
     D  DS2_FLD20                    50
     D  DS2_FLD21                    50
     D  DS2_FLD22                    50
     D  DS2_FLD23                    50
     D  DS2_FLD24                    50
     D  DS2_FLD25                    50
     D  DS2_FLD26                    50
     D  DS2_FLD27                    50
     D  DS2_FLD28                    50
     D  DS2_FLD29                    50
     D  DS2_FLD30                    50
     D  DS2_FLD31                    50
     D  DS2_FLD32                    50
     D  DS2_FLD33                    50
     D  DS2_FLD34                    50
     D  DS2_FLD35                    50
     D  DS2_FLD36                    50
     D  DS2_FLD37                    50
     D  DS2_FLD38                    50
     D  DS2_FLD39                    50
     D  DS2_FLD40                    50
     D  DS2_FLD41                    50
     D  DS2_FLD42                    50
     D  DS2_FLD43                    50
     D  DS2_FLD44                    50
     D  DS2_FLD45                    50
     D  DS2_FLD46                    50
     D  DS2_FLD47                    50
     D  DS2_FLD48                    50
     D  DS2_FLD49                    50
     D  DS2_FLD50                    50

     D DS3             DS
     D  DS3_FLD1                     50
     D  DS3_FLD2                     50
     D  DS3_FLD3                     50
     D  DS3_FLD4                     50
     D  DS3_FLD5                     50
     D  DS3_FLD6                     50
     D  DS3_FLD7                     50
     D  DS3_FLD8                     50
     D  DS3_FLD9                     50
     D  DS3_FLD10                    50
     D  DS3_FLD11                    50
     D  DS3_FLD12                    50
     D  DS3_FLD13                    50
     D  DS3_FLD14                    50
     D  DS3_FLD15                    50
     D  DS3_FLD16                    50
     D  DS3_FLD17                    50
     D  DS3_FLD18                    50
     D  DS3_FLD19                    50
     D  DS3_FLD20                    50
     D  DS3_FLD21                    50
     D  DS3_FLD22                    50
     D  DS3_FLD23                    50
     D  DS3_FLD24                    50
     D  DS3_FLD25                    50
     D  DS3_FLD26                    50
     D  DS3_FLD27                    50
     D  DS3_FLD28                    50
     D  DS3_FLD29                    50
     D  DS3_FLD30                    50
     D  DS3_FLD31                    50
     D  DS3_FLD32                    50
     D  DS3_FLD33                    50
     D  DS3_FLD34                    50
     D  DS3_FLD35                    50
     D  DS3_FLD36                    50
     D  DS3_FLD37                    50
     D  DS3_FLD38                    50
     D  DS3_FLD39                    50
     D  DS3_FLD40                    50
     D  DS3_FLD41                    50
     D  DS3_FLD42                    50
     D  DS3_FLD43                    50
     D  DS3_FLD44                    50
     D  DS3_FLD45                    50
     D  DS3_FLD46                    50
     D  DS3_FLD47                    50
     D  DS3_FLD48                    50
     D  DS3_FLD49                    50
     D  DS3_FLD50                    50

     D DS4             DS
     D  DS4_FLD1                     50
     D  DS4_FLD2                     50
     D  DS4_FLD3                     50
     D  DS4_FLD4                     50
     D  DS4_FLD5                     50
     D  DS4_FLD6                     50
     D  DS4_FLD7                     50
     D  DS4_FLD8                     50
     D  DS4_FLD9                     50
     D  DS4_FLD10                    50
     D  DS4_FLD11                    50
     D  DS4_FLD12                    50
     D  DS4_FLD13                    50
     D  DS4_FLD14                    50
     D  DS4_FLD15                    50
     D  DS4_FLD16                    50
     D  DS4_FLD17                    50
     D  DS4_FLD18                    50
     D  DS4_FLD19                    50
     D  DS4_FLD20                    50
     D  DS4_FLD21                    50
     D  DS4_FLD22                    50
     D  DS4_FLD23                    50
     D  DS4_FLD24                    50
     D  DS4_FLD25                    50
     D  DS4_FLD26                    50
     D  DS4_FLD27                    50
     D  DS4_FLD28                    50
     D  DS4_FLD29                    50
     D  DS4_FLD30                    50
     D  DS4_FLD31                    50
     D  DS4_FLD32                    50
     D  DS4_FLD33                    50
     D  DS4_FLD34                    50
     D  DS4_FLD35                    50
     D  DS4_FLD36                    50
     D  DS4_FLD37                    50
     D  DS4_FLD38                    50
     D  DS4_FLD39                    50
     D  DS4_FLD40                    50
     D  DS4_FLD41                    50
     D  DS4_FLD42                    50
     D  DS4_FLD43                    50
     D  DS4_FLD44                    50
     D  DS4_FLD45                    50
     D  DS4_FLD46                    50
     D  DS4_FLD47                    50
     D  DS4_FLD48                    50
     D  DS4_FLD49                    50
     D  DS4_FLD50                    50

     D DS5             DS
     D  DS5_FLD1                     50
     D  DS5_FLD2                     50
     D  DS5_FLD3                     50
     D  DS5_FLD4                     50
     D  DS5_FLD5                     50
     D  DS5_FLD6                     50
     D  DS5_FLD7                     50
     D  DS5_FLD8                     50
     D  DS5_FLD9                     50
     D  DS5_FLD10                    50
     D  DS5_FLD11                    50
     D  DS5_FLD12                    50
     D  DS5_FLD13                    50
     D  DS5_FLD14                    50
     D  DS5_FLD15                    50
     D  DS5_FLD16                    50
     D  DS5_FLD17                    50
     D  DS5_FLD18                    50
     D  DS5_FLD19                    50
     D  DS5_FLD20                    50
     D  DS5_FLD21                    50
     D  DS5_FLD22                    50
     D  DS5_FLD23                    50
     D  DS5_FLD24                    50
     D  DS5_FLD25                    50
     D  DS5_FLD26                    50
     D  DS5_FLD27                    50
     D  DS5_FLD28                    50
     D  DS5_FLD29                    50
     D  DS5_FLD30                    50
     D  DS5_FLD31                    50
     D  DS5_FLD32                    50
     D  DS5_FLD33                    50
     D  DS5_FLD34                    50
     D  DS5_FLD35                    50
     D  DS5_FLD36                    50
     D  DS5_FLD37                    50
     D  DS5_FLD38                    50
     D  DS5_FLD39                    50
     D  DS5_FLD40                    50
     D  DS5_FLD41                    50
     D  DS5_FLD42                    50
     D  DS5_FLD43                    50
     D  DS5_FLD44                    50
     D  DS5_FLD45                    50
     D  DS5_FLD46                    50
     D  DS5_FLD47                    50
     D  DS5_FLD48                    50
     D  DS5_FLD49                    50
     D  DS5_FLD50                    50

     D DS6             DS
     D  DS6_FLD1                     50
     D  DS6_FLD2                     50
     D  DS6_FLD3                     50
     D  DS6_FLD4                     50
     D  DS6_FLD5                     50
     D  DS6_FLD6                     50
     D  DS6_FLD7                     50
     D  DS6_FLD8                     50
     D  DS6_FLD9                     50
     D  DS6_FLD10                    50
     D  DS6_FLD11                    50
     D  DS6_FLD12                    50
     D  DS6_FLD13                    50
     D  DS6_FLD14                    50
     D  DS6_FLD15                    50
     D  DS6_FLD16                    50
     D  DS6_FLD17                    50
     D  DS6_FLD18                    50
     D  DS6_FLD19                    50
     D  DS6_FLD20                    50
     D  DS6_FLD21                    50
     D  DS6_FLD22                    50
     D  DS6_FLD23                    50
     D  DS6_FLD24                    50
     D  DS6_FLD25                    50
     D  DS6_FLD26                    50
     D  DS6_FLD27                    50
     D  DS6_FLD28                    50
     D  DS6_FLD29                    50
     D  DS6_FLD30                    50
     D  DS6_FLD31                    50
     D  DS6_FLD32                    50
     D  DS6_FLD33                    50
     D  DS6_FLD34                    50
     D  DS6_FLD35                    50
     D  DS6_FLD36                    50
     D  DS6_FLD37                    50
     D  DS6_FLD38                    50
     D  DS6_FLD39                    50
     D  DS6_FLD40                    50
     D  DS6_FLD41                    50
     D  DS6_FLD42                    50
     D  DS6_FLD43                    50
     D  DS6_FLD44                    50
     D  DS6_FLD45                    50
     D  DS6_FLD46                    50
     D  DS6_FLD47                    50
     D  DS6_FLD48                    50
     D  DS6_FLD49                    50
     D  DS6_FLD50                    50

     D DS7             DS
     D  DS7_FLD1                     50
     D  DS7_FLD2                     50
     D  DS7_FLD3                     50
     D  DS7_FLD4                     50
     D  DS7_FLD5                     50
     D  DS7_FLD6                     50
     D  DS7_FLD7                     50
     D  DS7_FLD8                     50
     D  DS7_FLD9                     50
     D  DS7_FLD10                    50
     D  DS7_FLD11                    50
     D  DS7_FLD12                    50
     D  DS7_FLD13                    50
     D  DS7_FLD14                    50
     D  DS7_FLD15                    50
     D  DS7_FLD16                    50
     D  DS7_FLD17                    50
     D  DS7_FLD18                    50
     D  DS7_FLD19                    50
     D  DS7_FLD20                    50
     D  DS7_FLD21                    50
     D  DS7_FLD22                    50
     D  DS7_FLD23                    50
     D  DS7_FLD24                    50
     D  DS7_FLD25                    50
     D  DS7_FLD26                    50
     D  DS7_FLD27                    50
     D  DS7_FLD28                    50
     D  DS7_FLD29                    50
     D  DS7_FLD30                    50
     D  DS7_FLD31                    50
     D  DS7_FLD32                    50
     D  DS7_FLD33                    50
     D  DS7_FLD34                    50
     D  DS7_FLD35                    50
     D  DS7_FLD36                    50
     D  DS7_FLD37                    50
     D  DS7_FLD38                    50
     D  DS7_FLD39                    50
     D  DS7_FLD40                    50
     D  DS7_FLD41                    50
     D  DS7_FLD42                    50
     D  DS7_FLD43                    50
     D  DS7_FLD44                    50
     D  DS7_FLD45                    50
     D  DS7_FLD46                    50
     D  DS7_FLD47                    50
     D  DS7_FLD48                    50
     D  DS7_FLD49                    50
     D  DS7_FLD50                    50

     D DS8             DS
     D  DS8_FLD1                     50
     D  DS8_FLD2                     50
     D  DS8_FLD3                     50
     D  DS8_FLD4                     50
     D  DS8_FLD5                     50
     D  DS8_FLD6                     50
     D  DS8_FLD7                     50
     D  DS8_FLD8                     50
     D  DS8_FLD9                     50
     D  DS8_FLD10                    50
     D  DS8_FLD11                    50
     D  DS8_FLD12                    50
     D  DS8_FLD13                    50
     D  DS8_FLD14                    50
     D  DS8_FLD15                    50
     D  DS8_FLD16                    50
     D  DS8_FLD17                    50
     D  DS8_FLD18                    50
     D  DS8_FLD19                    50
     D  DS8_FLD20                    50
     D  DS8_FLD21                    50
     D  DS8_FLD22                    50
     D  DS8_FLD23                    50
     D  DS8_FLD24                    50
     D  DS8_FLD25                    50
     D  DS8_FLD26                    50
     D  DS8_FLD27                    50
     D  DS8_FLD28                    50
     D  DS8_FLD29                    50
     D  DS8_FLD30                    50
     D  DS8_FLD31                    50
     D  DS8_FLD32                    50
     D  DS8_FLD33                    50
     D  DS8_FLD34                    50
     D  DS8_FLD35                    50
     D  DS8_FLD36                    50
     D  DS8_FLD37                    50
     D  DS8_FLD38                    50
     D  DS8_FLD39                    50
     D  DS8_FLD40                    50
     D  DS8_FLD41                    50
     D  DS8_FLD42                    50
     D  DS8_FLD43                    50
     D  DS8_FLD44                    50
     D  DS8_FLD45                    50
     D  DS8_FLD46                    50
     D  DS8_FLD47                    50
     D  DS8_FLD48                    50
     D  DS8_FLD49                    50
     D  DS8_FLD50                    50

     D DS9             DS
     D  DS9_FLD1                     50
     D  DS9_FLD2                     50
     D  DS9_FLD3                     50
     D  DS9_FLD4                     50
     D  DS9_FLD5                     50
     D  DS9_FLD6                     50
     D  DS9_FLD7                     50
     D  DS9_FLD8                     50
     D  DS9_FLD9                     50
     D  DS9_FLD10                    50
     D  DS9_FLD11                    50
     D  DS9_FLD12                    50
     D  DS9_FLD13                    50
     D  DS9_FLD14                    50
     D  DS9_FLD15                    50
     D  DS9_FLD16                    50
     D  DS9_FLD17                    50
     D  DS9_FLD18                    50
     D  DS9_FLD19                    50
     D  DS9_FLD20                    50
     D  DS9_FLD21                    50
     D  DS9_FLD22                    50
     D  DS9_FLD23                    50
     D  DS9_FLD24                    50
     D  DS9_FLD25                    50
     D  DS9_FLD26                    50
     D  DS9_FLD27                    50
     D  DS9_FLD28                    50
     D  DS9_FLD29                    50
     D  DS9_FLD30                    50
     D  DS9_FLD31                    50
     D  DS9_FLD32                    50
     D  DS9_FLD33                    50
     D  DS9_FLD34                    50
     D  DS9_FLD35                    50
     D  DS9_FLD36                    50
     D  DS9_FLD37                    50
     D  DS9_FLD38                    50
     D  DS9_FLD39                    50
     D  DS9_FLD40                    50
     D  DS9_FLD41                    50
     D  DS9_FLD42                    50
     D  DS9_FLD43                    50
     D  DS9_FLD44                    50
     D  DS9_FLD45                    50
     D  DS9_FLD46                    50
     D  DS9_FLD47                    50
     D  DS9_FLD48                    50
     D  DS9_FLD49                    50
     D  DS9_FLD50                    50

     D DS10            DS
     D  DS10_FLD1                    50
     D  DS10_FLD2                    50
     D  DS10_FLD3                    50
     D  DS10_FLD4                    50
     D  DS10_FLD5                    50
     D  DS10_FLD6                    50
     D  DS10_FLD7                    50
     D  DS10_FLD8                    50
     D  DS10_FLD9                    50
     D  DS10_FLD10                   50
     D  DS10_FLD11                   50
     D  DS10_FLD12                   50
     D  DS10_FLD13                   50
     D  DS10_FLD14                   50
     D  DS10_FLD15                   50
     D  DS10_FLD16                   50
     D  DS10_FLD17                   50
     D  DS10_FLD18                   50
     D  DS10_FLD19                   50
     D  DS10_FLD20                   50
     D  DS10_FLD21                   50
     D  DS10_FLD22                   50
     D  DS10_FLD23                   50
     D  DS10_FLD24                   50
     D  DS10_FLD25                   50
     D  DS10_FLD26                   50
     D  DS10_FLD27                   50
     D  DS10_FLD28                   50
     D  DS10_FLD29                   50
     D  DS10_FLD30                   50
     D  DS10_FLD31                   50
     D  DS10_FLD32                   50
     D  DS10_FLD33                   50
     D  DS10_FLD34                   50
     D  DS10_FLD35                   50
     D  DS10_FLD36                   50
     D  DS10_FLD37                   50
     D  DS10_FLD38                   50
     D  DS10_FLD39                   50
     D  DS10_FLD40                   50
     D  DS10_FLD41                   50
     D  DS10_FLD42                   50
     D  DS10_FLD43                   50
     D  DS10_FLD44                   50
     D  DS10_FLD45                   50
     D  DS10_FLD46                   50
     D  DS10_FLD47                   50
     D  DS10_FLD48                   50
     D  DS10_FLD49                   50
     D  DS10_FLD50                   50

     C                   SETON                                          LR