     C                   EXSR      F_CALL
     C                   SETON                                        RT
      *---------------------------------------------------------------------
    RD* Routine test SORTA
      *---------------------------------------------------------------------
     C     F_CALL        BEGSR
     C                   DO        10
     C                   CALL      'MUTE10_01C'
     C                   ENDDO
     C                   ENDSR
