     V*=====================================================================
     V* MODIFICHE Ril.  T Au Descrizione
     V* gg/mm/aa  nn.mm i xx Breve descrizione
     V*=====================================================================
     V* 06/11/20  002323  BERNI Creato
     V*=====================================================================
     D*  Pgm testing performance with only SETON LR
     V*---------------------------------------------------------------------
      *
     C                   SETON                                        LR
      *
      *---------------------------------------------------------------------
