     D                 DS
     D YFLD                         100    DIM(6)    CTDATA PERRCD(1)           _TXT_S81,20
     D  YFLD_FIL                     10    OVERLAY(YFLD:01)                     FILECAMPO
     D  YFLD_FLD                     10    OVERLAY(YFLD:11)                     NOME CAMPO
      *---------------------------------------------------------------------------------
     C                   SORTA     YFLD
    MU* Type="NOXMI"
     C                   SETON                                        LR
**CTDATA YFLD
E5ICEE0F  A5COCO    TAV§*IE
D5ICEE0F  B5MTRA    TAV§*IC
C5TREG0F  C5NU01                                                                Importo XML FE
BEREFE0F  D1COEN    CNNOM                                                       Account
A5STAT0F  E6CONT                                      51