      /IF NOT DEFINED(DUPLICATE_DEF_INCLUDED)
      /DEFINE DUPLICATE_DEF_INCLUDED
     C     SR1           BEGSR
     C                   ENDSR

     C     SR2           BEGSR
     C                   ENDSR
      /ENDIF