      * Helper declarations
     D £DBG_Str        S             2

      * Copies containing a duplicate DEFINE
      /COPY DUPDEF1
      /COPY DUPDEF2

      * Test output
     C                   EVAL      £DBG_Str='ok'
     C     £DBG_Str      DSPLY