      *  OBIETTIVO
      *  Test errori sintattici in direttive compilazione
      *  ELSE non assegnabile ad un IF
      /IF DEFINED(DEFINE_1)
      /ENDIF
      /ELSE
     C                   SETON                                        LR

