      *  OBIETTIVO
      *  Test errori sintattici in direttive compilazione
      *  ELSE non atteso
      /IF DEFINED(DEFINE_1)
      /ELSE
      /ELSE
      /ENDIF
     C                   SETON                                        LR

