     FEMPLOYEE  IF   E           K DISK    RENAME(EMPLOYEE:EMPREC)
     C                   if        %EQUAL
     C     'EQUAL=1'     DSPLY
     C                   ELSE
     C     'EQUAL=0'     DSPLY
     c                   endif
     C                   SETON                                          LR
