      *
      *BRARTIR is the name of record format of the file BRARTI0L
      *Fix error: Incongruous definitions of BRARTIR: RecordFormatType vs DataStructureType...
      *
     DBRARTIR        E DS                  EXTNAME(BRARTI0L) INZ
     C                   CLEAR                   BRART
     C     A§ARTI         DSPLY
