     DBRART          E DS                  EXTNAME(BRARTI0L) INZ
     C                   CLEAR                   BRART
     C     A§ARTI         DSPLY
