     FBRARTI0L  IF A E           K DISK

     D  DARTI          S                   LIKE(A§ARTI)
     C     DARTI          DSPLY

     C     *LIKE         DEFINE    A§ARTI        CARTI
     C     CARTI          DSPLY