     FEMPLOYEE  if   e           k disk    RENAME(EMPLOYEE:EMPREC)
      *
     C                   read      EMPLOYEE
     C                   DOW       not %EOF
     C     EMPNO         dsply
     C                   read      EMPLOYEE
     C                   enddo
     C                   seton                                        lr
