     FEMPLOYEE  IF   E           K DISK    RENAME(EMPLOYEE:EMPREC)
     **-------------------------------------------------------------------
     C     *LOVAL        SETLL     EMPLOYEE
     C                   READP     EMPLOYEE
     C                   DOW       NOT %EOF()
     C     EMPNO         DSPLY
     C                   READP     EMPLOYEE
     C                   ENDDO
     C                   SETON                                        LR
     **-------------------------------------------------------------------
     C                   SETON                                          LR
