     FVERAPG9L  IF   E           K DISK                                                             
      *--------------------------------------------------------------------------------------------*
     D $$DATA          S              8  0                                        Data              
     D $$CDC           S             15                                           Commessa          
      *--------------------------------------------------------------------------------------------*
     C                   EVAL      $$DATA=*HIVAL                                                    
     C                   EVAL      $$CDC='XXXXXXXXXXXXXXX'                                          
     C     K9L           KLIST                                                                      
     C                   KFLD                    $$DATA                                             
     C                   KFLD                    $$CDC                                              
      *...............................................................HiLoEq                        
     C     K9L           SETGT     VERAPG9L                           5051                          
      *                                                                                             
      * 50 must be *ON                                                                              
      * 51 must be *OFF                                                                             
      *                                                                                             
     C                   SETON                                        LR                            
      *--------------------------------------------------------------------------------------------*