     FVERAPG9L  IF   E           K DISK
      *--------------------------------------------------------------------------------------------*
     D $$DATA          S              8  0                                        Data
     D $$CDC           S             15                                           Commessa
      *--------------------------------------------------------------------------------------------*
     C                   EVAL      $$DATA=99999999
     C                   EVAL      $$CDC='XXXXXXXXXXXXXXX'
     C     K9L           KLIST
     C                   KFLD                    $$DATA
     C                   KFLD                    $$CDC
      *...............................................................HiLoEq
     C     K9L           SETLL     VERAPG9L                           505152
      *
      * 50 must be *ON
      * 51 must be *OFF
      * 52 must be *OFF
      *
     C                   SETON                                        LR
      *--------------------------------------------------------------------------------------------*