     V* ==============================================================
     V* 09/06/2025 APU002 Creation
     V* ==============================================================
    O * PROGRAM GOAL
    O * Emit RPG Traces
     V* ==============================================================
      /COPY TELSPAN
     C                   SETON                                        LR