     C     *entry        plist
     C                   parm                    ppdat             8            I
      *
     C                   call      'CALCFIB'
     C                   parm                    ppdat
     C                   seton                                        lr
      *--------------------------------------------------------------*
