     *** The compilation of this program fails on AS400
     C     *entry        plist
     C                   parm                    ppdat
      *
     C                   call      'CALCFIB'
     C                   parm                    ppdat
     C                   seton                                        lr
      *--------------------------------------------------------------*
