     V* ==============================================================
     D* Force error inside a copy in order to evaluate the logs
     D* quality. CU validating, variable MSGCPY2 not declared
     V* ==============================================================
     C                   EVAL      MSGCPY2='Hi I am QILEGEN,TSTCPY01'
     C     MSGCPY2       DSPLY