     V* ==============================================================
     D* Force error inside a copy in order to evaluate the logs
     D* quality. Syntax error
     V* ==============================================================
     C                   EVAL      MSG CPY='Hi I am QILEGEN,TSTCPY01'
     C     MSGCPY        DSPLY