     V* ==============================================================
     D* Force error inside a copy in order to evaluate the logs
     D* quality. Using of opcode not valid
     V* ==============================================================
     C                   EVAL      MSGCPY='Hi I am QILEGEN,TSTCPY01'
      * DSPL does not exists
     C     MSGCPY        DSPL