     V* ==============================================================
     D* 07/02/24  v1.r1 lanmam
     V* ==============================================================
     C                   EVAL      MSGCPY='Hi I am QILEGEN,CP§01'
     C     MSGCPY        DSPLY