      * This is a dummy and mocked implementation.
     C     £DBG          BEGSR

     C     *BLANK        IFNE       £DBG_Str
     C     £DBG_Str      DSPLY
     C                   EVAL       £DBG_Str = *BLANKS
     C                   ENDIF

     C                   ENDSR