     C                   EVAL      £DBG_Str='OK'
     C     £DBG_Str      DSPLY
      /EOF
     C                   EVAL      £DBG_Str='ERROR'
     C     £DBG_Str      DSPLY