     C                   EVAL      £DBG_Str='PRINT'
     C     £DBG_Str      DSPLY
      /EOF
     C                   EVAL      £DBG_Str='NOPRINT'
     C     £DBG_Str      DSPLY