     V* ==============================================================
     D* 02/01/22  v1.r1 lanmam
     V* ==============================================================
     C                   EVAL      MSGCPY='Hi I am QILEGEN,TSTCPY01'
     C     MSGCPY        DSPLY