     V*=====================================================================
     V* MODIFICHE Ril.  T Au  Descrizione
     V* gg/mm/aa  nn.mm i xx  Breve descrizione
     V*=====================================================================
     V* 13/08/18  000106  BMA Creazione
     V* 16/08/18  V5R1    CM Check-out 000106 Rilasciato in SMEUP_TST
     V* 25/09/18  V5R1    ZS Rilascio 000106
     V*=====================================================================
     D SCHCHK          S              1S   DIM(100)  ccsid(1200)
     D SCHSOS          S              1S   DIM(100)  ccsid(1200)
