      * This is a dummy and mocked implementation.
      * The original file has several subroutines implementation.
     D DMS             S              1
