     V* ==============================================================
     V* MODIFICHE Ril.  T Au Descrizione
     V* gg/mm/aa  nn.mm i xx Breve descrizione
     V* ==============================================================
     V* 10/10/10  V3R1    AS DECEDIT(*JOBRUN) e CCSID(*CHAR : *JOBRUN)
     V* 27/10/16  V5R1   BMA OPTION(*SRCSTMT:*NOUNREF) e DEBUG(*INPUT)
     V* ==============================================================
     H*----------------------------------------------------------------
     H* Specifiche da inserire in testa ad ogni programma RPG
     H*----------------------------------------------------------------
     H* DECEDIT(*JOBRUN) DATEDIT(*DMY/) DFTACTGRP(*NO) ACTGRP(*CALLER)
     H* OPTION(*NODEBUGIO:*SRCSTMT:*NOUNREF) CCSID(*CHAR : *JOBRUN) DEBUG(*INPUT)
