     V* ==============================================================
     V* MODIFICHE Ril.  T Au Descrizione
     V* gg/mm/aa  nn.mm i xx Breve descrizione
     V* ==============================================================
     V* B£30901B  V4R1    CM Creato
     V* ==============================================================
     D £JaxCSC         S              1    INZ                                  1=Contesto creato
     D                                                                          2=Contes.disabilitat
     D                                                                          3=Contes.interno
     D £JaxCS          S              1    INZ                                  Costruisci il setup
      *      1 = Si                                                             programm di default
      *        = No
