      * This is a dummy and mocked implementation.
      * The original file has several subroutines implementation
      *  and doesn't have this `COPY`.
      /COPY QILEGEN,£HEX
