      *      Personalizzazione B£
     D B£5$DS          DS           100
      * N° 03 - Suff. pgm Exit £GPE  **             1
     D  T$B£5A                 1      1
      * N° 04 - Pgm chiusura sistema OJ            10
     D  T$B£5B                 2     11
      * N° 05 - Libreria pgm chius.  OJ            10
     D  T$B£5C                12     21
      * N° 06 - Azione chiusura      **             1
     D  T$B£5D                22     22
      * N° 07 - Salvataggi via O.S.  V2 SI/NO       1
     D  T$B£5E                23     23
      * N° 08 - Menù ad Albero       V2 SI/NO       1
     D  T$B£5F                24     24
      * N° 09 - Pgm di Supp.Compil   V2 SI/NO       1
     D  T$B£5G                25     25
      * N° 10 - Log Attiv.Utente     V2 SI/NO       1
     D  T$B£5H                26     26
      * N° 11 - Compil pgm in lingua V              1
     D  T$B£5I                27     27
      * N° 12 - Ctr.costanti pgm     V              1
     D  T$B£5J                28     28
      * N° 13 - Agg.Mod.Dinamico pgm V2 SI/NO       1
     D  T$B£5K                29     29
      * N° 14 - Attivaz. log £GPE    V2 SI/NO       1    1
     D  T$B£5M                31     31
      * N° 15 - Suff. oggetto GPE    **             1
     D  T$B£5N                32     32
      * N° 16 - SV-Att Setup default V2 SI/NO       1    1
     D  T$B£5P                34     34
      * N° 17 - Specif.precompilat.                 2
     D  T$B£5O                35     36
      * N° 18 - Attiva funzioni AOP  V2 SI/NO       1
     D  T$B£5Q                37     37
