      *      Modo esecuzione programmi
     D PGM$DS          DS           100
      * N° 03 - Solo simulazione     V2 SI/NO       1
     D  T$PGMA                 1      1
      * N° 04 - Log                                 1
     D  T$PGMB                 2      2
      * N° 05 - Stampa condizioni                   1
     D  T_PGMC                 3      3
      * N° 06 - Attiva performance                  1
     D  T_PGMD                 4      4
      * N° 07 - Condizioni log                     30
     D  T_PGME                 5     34
      * N° 08 - Attivaz. log £GPE                   1
     D  T_PGMF                35     35
