   COP* *NOUI
     V* ==============================================================
     V* MODIFICHE Ril.  T Au Descrizione
     V* gg/mm/aa  nn.mm i xx Breve descrizione
     V* ==============================================================
     V* 19/11/20  002366  BMA Created
     V* ==============================================================
      *--------------------------------------------------------------------------------------------*
     D  $METHOD        S             10
     D  $RESULT        S             50
      *--------------------------------------------------------------------------------------------*
      *
     C                   EVAL      $METHOD='FUN1'
     C                   CALL      'MUTE10_75'
     C                   PARM                    $METHOD
     C                   PARM                    $RESULT
      *
     C                   EVAL      $METHOD='FUN2'
     C                   CALL      'MUTE10_75'
     C                   PARM                    $METHOD
     C                   PARM                    $RESULT
      *
     C                   EVAL      $METHOD='FUN3'
     C                   CALL      'MUTE10_75'
     C                   PARM                    $METHOD
     C                   PARM                    $RESULT
      *
     C                   EVAL      $METHOD='FUN4'
     C                   CALL      'MUTE10_75'
     C                   PARM                    $METHOD
     C                   PARM                    $RESULT
      *
     C                   EVAL      $METHOD='FUN1'
     C                   CALL      'MUTE10_75'
     C                   PARM                    $METHOD
     C                   PARM                    $RESULT
      *
     C                   EVAL      $METHOD='FUN2'
     C                   CALL      'MUTE10_75'
     C                   PARM                    $METHOD
     C                   PARM                    $RESULT
      *
     C                   EVAL      $METHOD='FUN3'
     C                   CALL      'MUTE10_75'
     C                   PARM                    $METHOD
     C                   PARM                    $RESULT
      *
     C                   EVAL      $METHOD='FUN4'
     C                   CALL      'MUTE10_75'
     C                   PARM                    $METHOD
     C                   PARM                    $RESULT
      *
     C                   SETON                                        LR
