     FDUMMYV    CF   E             WORKSTN USROPN
     D A               S              2  0

     C     *ENTRY        PLIST
     C                   PARM                    A

     C                   EXFMT     FMT01

     C                   SETON                                        LR
