     FEXFMT1V   CF   E             WORKSTN USROPN
     D MSG             S             50          VARYING
     C                   EXFMT      FMT1
     C                   EVAL       MSG=FLD01
     C     MSG           DSPLY