     FEXFMT2V   CF   E             WORKSTN USROPN
     D MSG             S             50          VARYING
     C                   EVAL       FLD01='UPPERCASE'
     C                   EXFMT      FMT1
     C                   EVAL       MSG='FLD01:'+FLD01
     C     MSG           DSPLY