     V* ==============================================================
     D* 06/02/24  
     D* Test the file video metadata loading
     V* ==============================================================
     
     
     FB£DIR40V  CF   E             WORKSTN USROPN
     F                                     INFDS(DSSF01)



     