     FSRS01V    CF   E             WORKSTN USROPN
     D MSG             S             50          VARYING

     C                   EXFMT      FMT01
     C                   EVAL       MSG='MSG:'+MSG
     C     MSG           DSPLY