     D MSG             S             50          VARYING
     D A               S              2  0
     C     A             DOWLT      10
     C                   EVAL       A=A+1
     C                   ENDDO
     C                   EVAL       MSG='A:'+%CHAR(A)
     C     MSG           DSPLY
