     C     £DEC          BEGSR
     C                   IF        0
     C                   CALL      'ABC'
     C                   PARM                    £DECTP            2
     C                   ENDIF
     C                   ENDSR