      * This program has the sole purpose of being called from MUDRNRAPU00264.rpgle
      * It is intended to be slim version of £DEC that replicates a situation where
      * we have an API with an instatement data definition inside that is referenced
      * using a LIKE() keyword

     C     £DEC          BEGSR
     C                   IF        0
     C                   CALL      'ABC'
     C                   PARM                    £DECTP            2
     C                   ENDIF
     C                   ENDSR