      *====================================================================
      * smeup V6R1.021DV
      * Nome sorgente       : £ATRE
      * Sorgente di origine : SMEDEV/QILEGEN(£ATRE)
      * Esportato il        : 20240409 121049
      *====================================================================
     V*=====================================================================
     V* MODIFICHE Ril. Au Descrizione
     V* gg/mm/aa  VnRm xx Breve descrizione
     V*=====================================================================
     V* 01/12/06  V2R2 GG Tavolozza RGB
     V*=====================================================================
     D £AT             S              1    DIM(4)                               Attr.Input
     D £ATRPU          S              1    DIM(50)                              Puntatori
      * Colore RGB
     D £ATRGB          S             12    DIM(50)                              Puntatori
      * Descrizione Colore RGB
     D £ATRGB_N        S             15    DIM(50)                              Puntatori
      * Colore RGB
     D £ATRCG          S             15    DIM(50)
      * Descrizione Colore RGB
     D £ATRCG_N        S             35    DIM(50)
