
     V*=====================================================================
     V* MODIFICHE Ril.  T Au  Descrizione
     V* gg/mm/aa  nn.mm i xx  Breve descrizione
     V*=====================================================================
     V* 22/03/24  KOKOS   BERNI Riportato da DEV, tolto CCSID 1200
     V*=====================================================================
     D SCHCHK          S              1    DIM(100)
     D SCHSOS          S              1    DIM(100)
