     D  U$FUW2                 1    400
     D  U$AMBI                 1      2
     D  U$FUNZ                 3      4
     D  U$METO                 5      6
     D  U$TPOG                 7     18
     D  U$CDOG                19     33
     D  U$PERT                34     35
     D  U$COND                36     37
     D  U$SCHE                38     38
     D  U$MODA                39     39
     D  U$51AZ                40     41
     D  U$51DV                42     44
     D  U$51ES                45     48
     D  U$LOGI                49     50
     D  U$STRP                51     51
     D  U$SANA                52     53
     D  U$TRPC                54     61
     D  U$COD$               101    250    DIM(10)
     D  U$IMPO               251    400
     D  U$PRZA               401    401
     D  U$PARM               402    901