     D D51             S             20  6 DIM(99)
     D D52             S            100    DIM(99)
     D D53             S             20  6 DIM(99)
     D D5COSO        E DS                  EXTNAME(D5COSO0F)
     D  D50                                DIM(99) LIKE(D$C001) INZ
     D                                             OVERLAY(D5COSO:88)
