     V* ==============================================================
     V* MODIFICHE Ril.  T Au Descrizione
     V* gg/mm/aa  nn.mm i xx Breve descrizione
     V* ==============================================================
     V* 15/03/21  V5R1    BONMAI Creazione
     V* ==============================================================
      *--------------------------------------------------------------------------------------------*
     D £DECCD          S             15
     D £DECTP          S              2
     D £DECPA          S             10
     D £DECR1          S              1
     D £DECR2          S              1
     D £DECDE          S             35
     D £DECIN          S             15
     D £DEC35          S              1
     D £DEC36          S              1
     D £DECAM          S             10
     D £DECCO          S             10
     D £DECDT          S              8 0
      *
     D £DECDI          DS           512
     D £DECI_DELI                     1
     D £DECI_ROES                     1
      *
     D £DECDO          DS          2048
     D £DECO_TPAR                    12
     D £DECO_CPAR                    15
     D £DECO_DESC                   256
     D £DECO_LIVE                     1
     D £DECO_DTIN                     8
     D £DECO_ORIN                     6
     D £DECO_USIN                    10
     D £DECO_OGIN                    10
     D £DECO_DTAG                     8
     D £DECO_ORAG                     6
     D £DECO_USAG                    10
     D £DECO_OGAG                    10