     V* ==============================================================
     V* MODIFICHE Ril.  T Au Descrizione
     V* gg/mm/aa  nn.mm i xx Breve descrizione
     V* ==============================================================
     V* 15/03/21  V5R1    MB Creazione
     V* /COPY £DEC
     V* ==============================================================
      *--------------------------------------------------------------------------------------------*
      /COPY QILEGEN,£DECDS
     C     £DEC          BEGSR
      *
     C                   CALL      'B£DEC0'
     C                   PARM                    £DECCD
     C                   PARM                    £DECTP
     C                   PARM                    £DECPA
     C                   PARM                    £DECR1
     C                   PARM                    £DECR2
     C                   PARM                    £DECDE
     C                   PARM                    £DECIN
     C                   PARM                    £DEC35
     C                   PARM                    £DEC36
     C                   PARM                    £DECAM
     C                   PARM                    £DECCO
     C                   PARM                    £DECDT
     C                   PARM                    £DECDI
     C                   PARM                    £DECDO
      *
     C                   ENDSR