     V*=====================================================================
     V* MODIFICHE Ril.  T Au  Descrizione
     V* gg/mm/aa  nn.mm i xx  Breve descrizione
     V*=====================================================================
     V* 20/09/16  V5R1    BMA Aggiunta stringa di input a 30000 per funzione CON_E
     V*=====================================================================
     D £G49SI          DS          1024
     D £G49SE          DS         30000
      * Temporary fix
     D £G4935          S              1N
     D £G4936          S              1N