      *====================================================================
      * smeup V6R1.021DV
      * Nome sorgente       : £HEX
      * Sorgente di origine : QTEMP/QILEGEN(£HEX)
      * Esportato il        : 20240409 121021
      *====================================================================
      /IF NOT DEFINED(HEX_INCLUDED)
      /DEFINE HEX_INCLUDED
     V* ==============================================================
     V* MODIFICHE Ril.  T Au Descrizione
     V* gg/mm/aa  nn.mm i xx Breve descrizione
     V* ==============================================================
     V* 08/03/17  V5R1    CM Creazione
     V* 10/03/17  V5R1    AS Aggiunti 0E e 0F
     D* ==============================================================
     D*----------------------------------------------------------------
     D* OBIETTIVO
     D* Avere un unico punto in cui definire i valori esadefimali da utilizzare in Sme.UP
     D*
     D*----------------------------------------------------------------
     D£HEX_ST          PR         30000    VARYING
     D £HEX_LU                        5S 0 CONST
     D £HEX_CH                        1    CONST
     D*- Gruppo 0 -----------------------------------------------------
     D £HEX00          S              1    INZ(x'00')
     D £HEX01          S              1    INZ(x'01')
     D £HEX02          S              1    INZ(x'02')
     D £HEX03          S              1    INZ(x'03')
     D £HEX04          S              1    INZ(x'04')
     D £HEX05          S              1    INZ(x'05')
     D £HEX06          S              1    INZ(x'06')
     D £HEX07          S              1    INZ(x'07')
     D £HEX08          S              1    INZ(x'08')
     D £HEX09          S              1    INZ(x'09')
     D £HEX0A          S              1    INZ(x'0A')
     D £HEX0B          S              1    INZ(x'0B')
     D £HEX0C          S              1    INZ(x'0C')
     D £HEX0D          S              1    INZ(x'0D')
     D £HEX0E          S              1    INZ(x'0E')
     D £HEX0F          S              1    INZ(x'0F')
     D*- Gruppo 1 -----------------------------------------------------
     D £HEX10          S              1    INZ(x'10')
     D £HEX11          S              1    INZ(x'11')
     D £HEX12          S              1    INZ(x'12')
     D £HEX13          S              1    INZ(x'13')
     D £HEX14          S              1    INZ(x'14')
     D £HEX15          S              1    INZ(x'15')
     D £HEX16          S              1    INZ(x'16')
     D £HEX17          S              1    INZ(x'17')
     D £HEX18          S              1    INZ(x'18')
     D £HEX19          S              1    INZ(x'19')
     D £HEX1A          S              1    INZ(x'1A')
     D £HEX1B          S              1    INZ(x'1B')
     D £HEX1C          S              1    INZ(x'1C')
     D £HEX1D          S              1    INZ(x'1D')
     D £HEX1E          S              1    INZ(x'1E')
     D £HEX1F          S              1    INZ(x'1F')
     D*- Gruppo 2 -----------------------------------------------------
     D £HEX20          S              1    INZ(x'20')
     D £HEX21          S              1    INZ(x'21')
     D £HEX22          S              1    INZ(x'22')
     D £HEX23          S              1    INZ(x'23')
     D £HEX24          S              1    INZ(x'24')
     D £HEX25          S              1    INZ(x'25')
     D £HEX26          S              1    INZ(x'26')
     D £HEX27          S              1    INZ(x'27')
     D £HEX28          S              1    INZ(x'28')
     D £HEX29          S              1    INZ(x'29')
     D £HEX2A          S              1    INZ(x'2A')
     D £HEX2B          S              1    INZ(x'2B')
     D £HEX2C          S              1    INZ(x'2C')
     D £HEX2D          S              1    INZ(x'2D')
     D £HEX2E          S              1    INZ(x'2E')
     D £HEX2F          S              1    INZ(x'2F')
     D*- Gruppo 3 -----------------------------------------------------
     D £HEX30          S              1    INZ(x'30')
     D £HEX31          S              1    INZ(x'31')
     D £HEX32          S              1    INZ(x'32')
     D £HEX33          S              1    INZ(x'33')
     D £HEX34          S              1    INZ(x'34')
     D £HEX35          S              1    INZ(x'35')
     D £HEX36          S              1    INZ(x'36')
     D £HEX37          S              1    INZ(x'37')
     D £HEX38          S              1    INZ(x'38')
     D £HEX39          S              1    INZ(x'39')
     D £HEX3A          S              1    INZ(x'3A')
     D £HEX3B          S              1    INZ(x'3B')
     D £HEX3C          S              1    INZ(x'3C')
     D £HEX3D          S              1    INZ(x'3D')
     D £HEX3E          S              1    INZ(x'3E')
     D £HEX3F          S              1    INZ(x'3F')
     D*- Gruppo 4 -----------------------------------------------------
     D £HEX40          S              1    INZ(x'40')
     D £HEX41          S              1    INZ(x'41')
     D £HEX42          S              1    INZ(x'42')
     D £HEX43          S              1    INZ(x'43')
     D £HEX44          S              1    INZ(x'44')
     D £HEX45          S              1    INZ(x'45')
     D £HEX46          S              1    INZ(x'46')
     D £HEX47          S              1    INZ(x'47')
     D £HEX48          S              1    INZ(x'48')
     D £HEX49          S              1    INZ(x'49')
     D £HEX4A          S              1    INZ(x'4A')
     D £HEX4B          S              1    INZ(x'4B')
     D £HEX4C          S              1    INZ(x'4C')
     D £HEX4D          S              1    INZ(x'4D')
     D £HEX4E          S              1    INZ(x'4E')
     D £HEX4F          S              1    INZ(x'4F')
     D*- Gruppo 5 -----------------------------------------------------
     D £HEX50          S              1    INZ(x'50')
     D £HEX51          S              1    INZ(x'51')
     D £HEX52          S              1    INZ(x'52')
     D £HEX53          S              1    INZ(x'53')
     D £HEX54          S              1    INZ(x'54')
     D £HEX55          S              1    INZ(x'55')
     D £HEX56          S              1    INZ(x'56')
     D £HEX57          S              1    INZ(x'57')
     D £HEX58          S              1    INZ(x'58')
     D £HEX59          S              1    INZ(x'59')
     D £HEX5A          S              1    INZ(x'5A')
     D £HEX5B          S              1    INZ(x'5B')
     D £HEX5C          S              1    INZ(x'5C')
     D £HEX5D          S              1    INZ(x'5D')
     D £HEX5E          S              1    INZ(x'5E')
     D £HEX5F          S              1    INZ(x'5F')
     D*- Gruppo 6 -----------------------------------------------------
     D £HEX60          S              1    INZ(x'60')
     D £HEX61          S              1    INZ(x'61')
     D £HEX62          S              1    INZ(x'62')
     D £HEX63          S              1    INZ(x'63')
     D £HEX64          S              1    INZ(x'64')
     D £HEX65          S              1    INZ(x'65')
     D £HEX66          S              1    INZ(x'66')
     D £HEX67          S              1    INZ(x'67')
     D £HEX68          S              1    INZ(x'68')
     D £HEX69          S              1    INZ(x'69')
     D £HEX6A          S              1    INZ(x'6A')
     D £HEX6B          S              1    INZ(x'6B')
     D £HEX6C          S              1    INZ(x'6C')
     D £HEX6D          S              1    INZ(x'6D')
     D £HEX6E          S              1    INZ(x'6E')
     D £HEX6F          S              1    INZ(x'6F')
     D*- Gruppo 7 -----------------------------------------------------
     D £HEX70          S              1    INZ(x'70')
     D £HEX71          S              1    INZ(x'71')
     D £HEX72          S              1    INZ(x'72')
     D £HEX73          S              1    INZ(x'73')
     D £HEX74          S              1    INZ(x'74')
     D £HEX75          S              1    INZ(x'75')
     D £HEX76          S              1    INZ(x'76')
     D £HEX77          S              1    INZ(x'77')
     D £HEX78          S              1    INZ(x'78')
     D £HEX79          S              1    INZ(x'79')
     D £HEX7A          S              1    INZ(x'7A')
     D £HEX7B          S              1    INZ(x'7B')
     D £HEX7C          S              1    INZ(x'7C')
     D £HEX7D          S              1    INZ(x'7D')
     D £HEX7E          S              1    INZ(x'7E')
     D £HEX7F          S              1    INZ(x'7F')
     D*- Gruppo 8 -----------------------------------------------------
     D £HEX80          S              1    INZ(x'80')
     D £HEX81          S              1    INZ(x'81')
     D £HEX82          S              1    INZ(x'82')
     D £HEX83          S              1    INZ(x'83')
     D £HEX84          S              1    INZ(x'84')
     D £HEX85          S              1    INZ(x'85')
     D £HEX86          S              1    INZ(x'86')
     D £HEX87          S              1    INZ(x'87')
     D £HEX88          S              1    INZ(x'88')
     D £HEX89          S              1    INZ(x'89')
     D £HEX8A          S              1    INZ(x'8A')
     D £HEX8B          S              1    INZ(x'8B')
     D £HEX8C          S              1    INZ(x'8C')
     D £HEX8D          S              1    INZ(x'8D')
     D £HEX8E          S              1    INZ(x'8E')
     D £HEX8F          S              1    INZ(x'8F')
     D*- Gruppo 9 -----------------------------------------------------
     D £HEX90          S              1    INZ(x'90')
     D £HEX91          S              1    INZ(x'91')
     D £HEX92          S              1    INZ(x'92')
     D £HEX93          S              1    INZ(x'93')
     D £HEX94          S              1    INZ(x'94')
     D £HEX95          S              1    INZ(x'95')
     D £HEX96          S              1    INZ(x'96')
     D £HEX97          S              1    INZ(x'97')
     D £HEX98          S              1    INZ(x'98')
     D £HEX99          S              1    INZ(x'99')
     D £HEX9A          S              1    INZ(x'9A')
     D £HEX9B          S              1    INZ(x'9B')
     D £HEX9C          S              1    INZ(x'9C')
     D £HEX9D          S              1    INZ(x'9D')
     D £HEX9E          S              1    INZ(x'9E')
     D £HEX9F          S              1    INZ(x'9F')
     D*- Gruppo A -----------------------------------------------------
     D £HEXA0          S              1    INZ(x'A0')
     D £HEXA1          S              1    INZ(x'A1')
     D £HEXA2          S              1    INZ(x'A2')
     D £HEXA3          S              1    INZ(x'A3')
     D £HEXA4          S              1    INZ(x'A4')
     D £HEXA5          S              1    INZ(x'A5')
     D £HEXA6          S              1    INZ(x'A6')
     D £HEXA7          S              1    INZ(x'A7')
     D £HEXA8          S              1    INZ(x'A8')
     D £HEXA9          S              1    INZ(x'A9')
     D £HEXAA          S              1    INZ(x'AA')
     D £HEXAB          S              1    INZ(x'AB')
     D £HEXAC          S              1    INZ(x'AC')
     D £HEXAD          S              1    INZ(x'AD')
     D £HEXAE          S              1    INZ(x'AE')
     D £HEXAF          S              1    INZ(x'AF')
     D*- Gruppo B -----------------------------------------------------
     D £HEXB0          S              1    INZ(x'B0')
     D £HEXB1          S              1    INZ(x'B1')
     D £HEXB2          S              1    INZ(x'B2')
     D £HEXB3          S              1    INZ(x'B3')
     D £HEXB4          S              1    INZ(x'B4')
     D £HEXB5          S              1    INZ(x'B5')
     D £HEXB6          S              1    INZ(x'B6')
     D £HEXB7          S              1    INZ(x'B7')
     D £HEXB8          S              1    INZ(x'B8')
     D £HEXB9          S              1    INZ(x'B9')
     D £HEXBA          S              1    INZ(x'BA')
     D £HEXBB          S              1    INZ(x'BB')
     D £HEXBC          S              1    INZ(x'BC')
     D £HEXBD          S              1    INZ(x'BD')
     D £HEXBE          S              1    INZ(x'BE')
     D £HEXBF          S              1    INZ(x'BF')
     D*- Gruppo C -----------------------------------------------------
     D £HEXC0          S              1    INZ(x'C0')
     D £HEXC1          S              1    INZ(x'C1')
     D £HEXC2          S              1    INZ(x'C2')
     D £HEXC3          S              1    INZ(x'C3')
     D £HEXC4          S              1    INZ(x'C4')
     D £HEXC5          S              1    INZ(x'C5')
     D £HEXC6          S              1    INZ(x'C6')
     D £HEXC7          S              1    INZ(x'C7')
     D £HEXC8          S              1    INZ(x'C8')
     D £HEXC9          S              1    INZ(x'C9')
     D £HEXCA          S              1    INZ(x'CA')
     D £HEXCB          S              1    INZ(x'CB')
     D £HEXCC          S              1    INZ(x'CC')
     D £HEXCD          S              1    INZ(x'CD')
     D £HEXCE          S              1    INZ(x'CE')
     D £HEXCF          S              1    INZ(x'CF')
     D*- Gruppo D -----------------------------------------------------
     D £HEXD0          S              1    INZ(x'D0')
     D £HEXD1          S              1    INZ(x'D1')
     D £HEXD2          S              1    INZ(x'D2')
     D £HEXD3          S              1    INZ(x'D3')
     D £HEXD4          S              1    INZ(x'D4')
     D £HEXD5          S              1    INZ(x'D5')
     D £HEXD6          S              1    INZ(x'D6')
     D £HEXD7          S              1    INZ(x'D7')
     D £HEXD8          S              1    INZ(x'D8')
     D £HEXD9          S              1    INZ(x'D9')
     D £HEXDA          S              1    INZ(x'DA')
     D £HEXDB          S              1    INZ(x'DB')
     D £HEXDC          S              1    INZ(x'DC')
     D £HEXDD          S              1    INZ(x'DD')
     D £HEXDE          S              1    INZ(x'DE')
     D £HEXDF          S              1    INZ(x'DF')
     D*- Gruppo E -----------------------------------------------------
     D £HEXE0          S              1    INZ(x'E0')
     D £HEXE1          S              1    INZ(x'E1')
     D £HEXE2          S              1    INZ(x'E2')
     D £HEXE3          S              1    INZ(x'E3')
     D £HEXE4          S              1    INZ(x'E4')
     D £HEXE5          S              1    INZ(x'E5')
     D £HEXE6          S              1    INZ(x'E6')
     D £HEXE7          S              1    INZ(x'E7')
     D £HEXE8          S              1    INZ(x'E8')
     D £HEXE9          S              1    INZ(x'E9')
     D £HEXEA          S              1    INZ(x'EA')
     D £HEXEB          S              1    INZ(x'EB')
     D £HEXEC          S              1    INZ(x'EC')
     D £HEXED          S              1    INZ(x'ED')
     D £HEXEE          S              1    INZ(x'EE')
     D £HEXEF          S              1    INZ(x'EF')
     D*- Gruppo F -----------------------------------------------------
     D £HEXF0          S              1    INZ(x'F0')
     D £HEXF1          S              1    INZ(x'F1')
     D £HEXF2          S              1    INZ(x'F2')
     D £HEXF3          S              1    INZ(x'F3')
     D £HEXF4          S              1    INZ(x'F4')
     D £HEXF5          S              1    INZ(x'F5')
     D £HEXF6          S              1    INZ(x'F6')
     D £HEXF7          S              1    INZ(x'F7')
     D £HEXF8          S              1    INZ(x'F8')
     D £HEXF9          S              1    INZ(x'F9')
     D £HEXFA          S              1    INZ(x'FA')
     D £HEXFB          S              1    INZ(x'FB')
     D £HEXFC          S              1    INZ(x'FC')
     D £HEXFD          S              1    INZ(x'FD')
     D £HEXFE          S              1    INZ(x'FE')
     D £HEXFF          S              1    INZ(x'FF')
     D*----------------------------------------------------------------
      /ENDIF
