     V* ==============================================================
     V* MODIFICHE Ril.  T Au Descrizione
     V* gg/mm/aa  nn.mm i xx Breve descrizione
     V* ==============================================================
     V* 15/03/21  V5R1    MB Creazione
     V* /COPY £JAX_C9
     V* ==============================================================
      *--------------------------------------------------------------------------------------------*
     C     £JAX_INZP     BEGSR
      *
     C     *ENTRY        PLIST
     C                   PARM                    £UIBDS
      *
     C                   ENDSR