      *====================================================================
      * smeup V6R1.021DV
      * Nome sorgente       : £JAX_O
      * Sorgente di origine : SMEDEV/QILEGEN(£JAX_O)
      * Esportato il        : 20240411 144724
      *====================================================================
     V* ==============================================================
     V* MODIFICHE Ril.  T Au Descrizione
     V* gg/mm/aa  nn.mm i xx Breve descrizione
     V* 13/05/05  V2R1    CM Raggruppamento /COPY di comunicazione
     V* B£30901B  V4R1    CM Aggiounto prototipo J15 per gestione Setup
     V* 06/10/16  V5R1    PEDSTE Eliminata /COPY £JAX_O0 per nuova gestione prtf in JAJAX3
     V* ==============================================================
      */COPY QILEGEN,£JAX_O0
      /COPY QILEGEN,£JAX_PC1
      /COPY QPROGEN,£J15P
