
     V* ==============================================================
     V* MODIFICHE Ril.  T Au Descrizione
     V* gg/mm/aa  nn.mm i xx Breve descrizione
     V* ==============================================================
     V* 20/03/24  KOKOS   BERNI Riportata /copy da SMEDEV, tolte G61, G64 e J15
     V* ==============================================================
      /COPY QILEGEN,£JAX_D0
      /INCLUDE QILEGEN,£JAX_D1
      /COPY QILEGEN,£JAX_D4
      /COPY QILEGEN,£TABPGMDS
      /COPY QILEGEN,£TABB£5DS
      /COPY QILEGEN,£TABUI1DS
      /COPY QILEGEN,£UIBDS
      /COPY QILEGEN,£UICDS
      /COPY QILEGEN,£G96DS
      /COPY QILEGEN,£B£UT67DS
      /COPY QILEGEN,£JAX_PD1
