     V* ==============================================================
     V* MODIFICHE Ril.  T Au Descrizione
     V* gg/mm/aa  nn.mm i xx Breve descrizione
     V* ==============================================================
     V* 10/05/21  V5R1    BONMAI Creazione
     V* /COPY £UIBDS
     V* ==============================================================
      *--------------------------------------------------------------------------------------------*
     D £UIBDS          DS            10
     D £UIBPG                        10A
     D £UIBFU                          0
     D £UIBME                          0
     D £UIBT1                          0
     D £UIBP1                          0
     D £UIBK1                          0
     D £UIBT2                          0
     D £UIBP2                          0
     D £UIBK2                          0
     D £UIBT3                          0
     D £UIBP3                          0
     D £UIBK3                          0
     D £UIBPA                          0
     D £UIBT4                          0
     D £UIBP4                          0
     D £UIBK4                          0
     D £UIBT5                          0
     D £UIBP5                          0
     D £UIBK5                          0
     D £UIBT6                          0
     D £UIBP6                          0
     D £UIBK6                          0
     D £UIBD1                          0
      *--------------------------------------------------------------------------------------------*