      *---------------------------------------------------------------
      * Test Field Overlay
      *---------------------------------------------------------------
     DMYDS             DS
     DFLD1                            3A   INZ('ABC')
     DFLD2                            3A   INZ('EFG')
     DFLD3                            3A   INZ('HIL')
     DFLDX                            2A   OVERLAY(FLD1)

      *---------------------------------------------------------------
      * M A I N
      *---------------------------------------------------------------

      *
     C                   SETON                                        RT
