      *---------------------------------------------------------------
      * Test Structure Overlay
      *---------------------------------------------------------------
     DMYDS             DS
     DFLD1                            3A
     DFLD2                            3A
     DFLD3                            3A
     DFLDX                            3A   DIM(3) OVERLAY(MYDS)
      *---------------------------------------------------------------
      * M A I N
      *---------------------------------------------------------------
     C
      *
     C                   SETON                                        RT
