      *---------------------------------------------------------------
      * Test Field Overlay provided
      *---------------------------------------------------------------
     DMYDS             DS
     D FIELD01                       45    DIM(100)
     D  SUBF11                       15    OVERLAY(FIELD01:1)
     D  SUBF12                       10    OVERLAY(FIELD01:*NEXT)
      *---------------------------------------------------------------
      * M A I N
      *---------------------------------------------------------------
     C                   DSPLY                   FIELD01
      *
     C                   SETON                                        RT
