      *---------------------------------------------------------------
      * This test must fail because it is not set neither factor 1 nor result
      * OCCURS keyword
      *---------------------------------------------------------------
     D DS1             DS                  OCCURS(50)
     D  FLDA                   1      5
     D  FLDB

     C                   OCCUR     DS2