      *---------------------------------------------------------------
      * Test OCCURS support
      *---------------------------------------------------------------
     D DS1             DS                  OCCURS(50)
     D  FLDA                   1      5
     D  FLDB                   6     80
      *
     D DS2             DS                  OCCURS(50)
     D  FLDC                   1      6
     D  FLDD                   7     11
      *
     D DS3             DS
     D  FLDE                   1      6
     D  FLDF                   7     11
