      * Call a pgm with the same ACTGRP (*DFTACTGRP), twice, within one root execution
     C                   CALL      'ACTGRPNF2'
     C                   CALL      'ACTGRPNF2'
      *
     C                   SETON                                          LR
