      * Call a pgm with the same ACTGRP (*DFTACTGRP)
     C                   CALL      'ACTGRP_02'
      *
      * Call a pgm with the same ACTGRP (*DFTACTGRP)
     C                   CALL      'ACTGRP_02'
      *
      * Call a pgm with the same ACTGRP (*DFTACTGRP)
     C                   CALL      'ACTGRP_02'
      *
     C                   SETON                                          LR