     H ACTGRP('CUSTOM')
      *
      * Call a pgm with the same ACTGRP (CUSTOM)
     C                   CALL      'ACTGRP_06'
      *
      * Call a pgm with the same ACTGRP (CUSTOM)
     C                   CALL      'ACTGRP_06'
      *
      * Call a pgm with the same ACTGRP (CUSTOM)
     C                   CALL      'ACTGRP_06'
      *
     C                   SETON                                          LR