     H ACTGRP(*CALLER)
     D STRVAR          S             20
     C                   EVAL      STRVAR = %TRIM(STRVAR)+'10.'
     C                   SETON                                          RT