     D STRVAR          S             20
     C                   EVAL      STRVAR = %TRIM(STRVAR)+'02.'
     C                   SETON                                          RT