     H ACTGRP('CUSTOM')
     D STRVAR          S             20
     C                   EVAL      STRVAR = %TRIM(STRVAR)+'06.'
     C                   SETON                                          LR