      *
      * Call a pgm with different ACTGRP (CUSTOM8)
     C                   CALL      'ACTGRP_08'
      *
      * Call a pgm with different ACTGRP (CUSTOM9)
     C                   CALL      'ACTGRP_09'
      *
     C                   SETON                                          LR