     H ACTGRP('CUSTOM8')
      *
      * Call a pgm with different ACTGRP (*CALLER)
     C                   CALL      'ACTGRP_10'
      *
      * Call a pgm with different ACTGRP (*CALLER)
     C                   CALL      'ACTGRP_10'
      *
      * Call a pgm with different ACTGRP (*CALLER)
     C                   CALL      'ACTGRP_10'
      *
      * Call a pgm with different ACTGRP (*CALLER)
     C                   CALL      'ACTGRP_10'
      *
     C                   SETON                                          RT