      * Never touches LR or RT at all - just falls off the end of the mainline.
     D STATNUM         S             10P 0
     C                   DSPLY                   STATNUM
     C                   EVAL      STATNUM = STATNUM + 1
      *
     C                   RETURN
