     C                   CALL      'ACTGRP_FIX'
     C                   CALL      'ACTGRP_FIX'
     C                   CALL      'ACTGRP_FIX'
     C                   CALL      'ACTGRP_NEW'
     C                   CALL      'ACTGRP_NEW'
     C                   CALL      'ACTGRP_NEW'
     C                   SETON                                          LR
