      * This API contains an intentionally mistake
      * It tries to add X to Y return the Z but
      * none of them is defined
      *--------------------------------------------------------------*
     C     SUM           BEGSR
      *
     C                   EVAL      Z = X + Y
      *
     C                   ENDSR
      *--------------------------------------------------------------*