      * Api containing data, procedure and subroutine definition
     D GREETING        S             50          VARYING

     C     SUBGREETING   BEGSR
     C                   EVAL      GREETING='Hello there!'
     C     GREETING      DSPLY
     C                   ENDSR

     PPROCNAME         B
     DPROCNAME         PI
     Dn                              50    CONST VARYING
     C        n          DSPLY
     PPROCNAME         E