     D X               S              2  0 inz(10)
     D Y               S              2  0 inz(20)
     D Z               S              4  0 inz(18)
      *--------------------------------------------------------------*
     C     SUM           BEGSR
      *
     C                   EVAL      Z = X + Y
      *
     C                   ENDSR
      *--------------------------------------------------------------*