      * Api containing only procedure definition
     PPROC             B
     DPROC             PI
     Dp                               2  0
     Dq                               2  0
     Dr                               2  0
     C                   EVAL      r=p*q
     PPROC             E