      * Api containing only procedure definition
     PPROCA            B
     DPROCA            PI
     Dp                               2  0
     Dq                               2  0
     Dr                               2  0
     C                   EVAL      r=p*q
     PPROCA            E

     PPROCB            B
     DPROCB            PI
     Dp                               2  0
     Dq                               2  0
     Dr                               2  0
     C                   EVAL      r=(p*2)+(q*2)
     PPROCB            E