      * Api containing only subroutine definition
     D GREETING        S             50          VARYING

     C     SUBROUTINEB   BEGSR
     C                   EVAL      GREETING='General Jinn'
     C     GREETING      DSPLY
     C                   ENDSR