     D Msg             S             12
     D Arr             S              1    DIM(3)
     D Str             S              3    INZ('ABC')
     C                   Eval      Arr = Str
     C                   Eval      Msg  = Arr(1) + '-' + Arr(2) + '-' + Arr(3)
     C     Msg           dsply
     C                   SETON                                          LR
