     D Msg             S             12
     DARC              S              3A   DIM(12) PERRCD(1) CTDATA
     D I1              S              5  0
      *---------------------------------------------------------------------
     C                   FOR       I1 = 1 TO 12
     C                   EVAL      Msg = ARC(I1)
     C     Msg           DSPLY
     C                   ENDFOR
     C                   SETON                                          LR
**CTDATA ARC
abcComments can be placed here
123
abc
123
abcComments can be placed here
123
abc
123
abc
123Comments can be placed here
abc
xxxComments can be placed here
