     D Msg             S             12
     D Arr             S              1    DIM(2)
     C                   Eval      Arr(1) = 'X'
     C                   Eval      Arr(2) = 'Y'
     C                   Eval      Msg  = Arr(1) + '-' + Arr(2)
     C     Msg           dsply
     C                   SETON                                          LR
