     darr1             s              3  0 dim(5) ctdata perrcd(1)
     darr2             s              3  0 dim(5) ctdata perrcd(1)
     dS                s              3  0 inz(0)
     dn                s              2  0 inz(1)
     c     n             do        5
     c                   eval      s=arr2(n)-arr1(n)
     c     s             dsply
     c                   eval      n+=1
     c                   enddo
     c                   seton                                        LR
**CTDATA arr2
201
202
203
204
205
**CTDATA arr1
101
102
103
104
105
