     D Msg             S             12
     DARC              S              3A   DIM(12) PERRCD(5) CTDATA
     D I1              S              5  0
      *---------------------------------------------------------------------
     C                   FOR       I1 = 1 TO 12
     C     ARC(I1)       DSPLY
     C                   ENDFOR
     C                   SETON                                          LR
**CTDATA ARC
abc123abc123abcComments can be placed here
123abc123abc123Comments can be placed here
abcxxx         Comments can be placed here
