     D ARR1            S              4    DIM(3)
     D MSG             S             12
     **-------------------------------------------------------------------
     C                   EVAL      ARR1(1) = 'AB'
     C                   EVAL      ARR1(2) = 'CD'
     C                   EVAL      ARR1(3) = 'EF'
     C                   EVAL      MSG = ARR1(1) + ARR1(2) + ARR1(3)
     C                   DSPLY                   MSG
     **-------------------------------------------------------------------
     C                   SETON                                          LR
