     D Arr             S             40    DIM(2)
      *---------------------------------------------------------------
     C     *ENTRY        PLIST
     C                   PARM                    Arr
     **************************************************************
     C                   DSPLY                   Arr(1)
     C                   SETON                                          LR