     D Msg             S              6    inz('------')
     C                   Eval      %subst(Msg:2:3) = 'xyz'
     C                   dsply                   Msg
     C                   SETON                                          LR
