     D Msg             S              6    inz('------')
     C                   Eval      %subst(Msg:2:3) = 'xyz'
     C                   dsply                   Msg
     ************************************************************************
     C                   Eval      Msg = '------'
     C                   Eval      %subst(Msg:2)   = 'xyz'
     C                   dsply                   Msg
     ************************************************************************
     C                   Eval      Msg = '------'
     C                   Eval      %subst(Msg:2:4) = 'xyz'
     C                   dsply                   Msg
     ************************************************************************
     C                   SETON                                          LR
