     D MSG             S             10    Inz('Hello')

     D RESULT          S             10
     *********************************************************************
     C                   Eval       RESULT = %EDITC(%LEN(%TRIM(MSG)):'X')
     C     RESULT        dsply
     *********************************************************************
     C                   Seton                                        LR