     D NBR             S              8  0
     C     *ENTRY        PLIST
     C                   PARM                    NBR
     C                   IF        NBR = 0
     C                   EVAL      NBR = 1
     C                   ELSE
     C                   EVAL      NBR = 2
     C                   ENDIF
     C                   SETON                                        LR
