      * Example of a call with parm defined and initialized inline
     ** Implicit declaration of a number with 3 digits, 2 of them are decimals
     *************************************************************************
     C                   call      'CALCFIB'
     C                   parm      '10'          ppdat             8
     C                   seton                                        lr
      *--------------------------------------------------------------*
