      * Example of a call with parm defined and initialized inline
     C                   call      'CALCFIB'
     C                   parm      '10'          ppdat             8
     C                   seton                                        lr
      *--------------------------------------------------------------*
