     D NBR             S              8  0 INZ(12)
     D RESULT          S              8  0 INZ(0)
    MU* VAL1(144) VAL2(RESULT) COMP(EQ)
     C                   call      'CALCFIB2'
     C                   parm                    NBR
     C                   parm                    RESULT
     C                   seton                                        lr