     C                   CALL      'CALLDEFV2'
     C                   PARM                    $A                2
     C                   EVAL      $A='T'
