     D P1              S              1
      *--------------------------------------------------------------*
     C     *ENTRY        PLIST
     C                   PARM                    P1
      *--------------------------------------------------------------*
     C                   EVAL      P1 = 'R'
      *--------------------------------------------------------------*
     C                   SETON                                        LR
