     D STR10           S             10
      *
     C                   CALL      'CALLED2'
     C                   PARM      'ABCDE'       STR10
      * Expected 'ABCDEFGHIJ'
     C     STR10         DSPLY
      *
     C                   SETON                                        LR