     D STR10           S             10
      *
     C     *ENTRY        PLIST
     C                   PARM                    STR10
      *
     C                   EVAL      STR10=%TRIM(STR10)+'FGHIJ'
      *
     C                   SETON                                        LR