      *----------------------------------------------------------------------
     D INPUT           S             50
      *----------------------------------------------------------------------
     C     *ENTRY        PLIST
     C                   PARM                    INPUT
      *
     C                   CALL      'TRANSLATE'
     C                   PARM                    INPUT
      *
     C                   DSPLY                   INPUT
      *
     C                   SETON                                        LR
      *----------------------------------------------------------------------
