     D Msg             S             12
     C                   clear                   n                 3 1
     C                   clear                   Msg
     C                   Eval      Msg  = 'Counter: ' + %char(n)
     C     Msg           dsply
     C                   SETON                                          LR
