     D Msg             S             12
     D DS1             DS
     D  Num                    2      5  0
     D  Char                  20     30A
     C                   clear                   DS1
     C                   Eval      Msg  = DS1
     C     Msg           dsply
     C                   SETON                                          LR
