     DMsg              S              1N
     C                   eval      Msg = %found
     C     Msg           dsply
     C                   eval      Msg = %eof
     C     Msg           dsply
     C                   SETON                                          LR
