     D Msg             S             12
     D n               S              8  0
     C                   Eval      N = n + 1
     C                   Eval      Msg  = 'Counter: ' + %char(n)
     C     Msg           dsply
     C                   SETON                                          RT
