     D SI              S             10    DIM(17) PERRCD(1) CTDATA             _NOTXT
     D I1              S              5  0
     D Msg             S             52
      *---------------------------------------------------------------------
     C                   FOR       I1 = 1 TO 17
     C                   EVAL      Msg=SI(I1)
     C     Msg           DSPLY
     C                   ENDFOR
     C                   SETON                                        LR
      *---------------------------------------------------------------------
** SI
001
d01
A01
c01
B01
b01
C01
901
101
D01
H01
E01
201
e01
a01
x01
X01
