     Dy                C                   CONST(30)
     Dx                S              3  0 INZ(30)
     Dz                S              3  0
     D msg             S             12
     C                   Eval      z = x + y
     C                   Eval      Msg = %CHAR(z)
     C                   dsply                   Msg
     C                   SETON                                          LR
