     D DSP             S             50
     D  N1             S             21  6
     D  N2             S             21  6
      **********************************************************************
     C                   EVAL      N1=12326,789
     C                   EVAL      N2=12326.789
     C                   IF        N1 = N2
     C                   EVAL      DSP='N1=N2'
     C                   ELSE
     C                   EVAL      DSP='N1<>N2'
     C                   ENDIF
     C                   DSPLY                   DSP
      **********************************************************************
     C                   SETON                                          LR
