     DMsg              S             50
      *
     C     *like         DEFINE    Msg           New
     C     *like         DEFINE    New           Newest
     C                   EVAL      Newest = 'Hello'
     C     Newest        Dsply
     C                   SETON                                        LR
