     DMsg              S             50
      *
     C     *like         DEFINE    Msg           New
     C                   EVAL      New = 'Hello'
     C     New           Dsply
     C                   SETON                                        LR
