     D Res             S             10  0
      *
     C                   EVAL      res =%diff(D'2010-02-01':D'1900-01-01':*D)
     C     Res           DSPLY
      *
     C                   SETON                                        LR
