      *---------------------------------------------------------------
      * SIMPLE PROGRAM THAT CALCULATES C = A / B
      *---------------------------------------------------------------
     D A               S              6  2
     D B               S              6  2
     D RESULT          S              6  2
     C
     C     *ENTRY        PLIST
     C                   PARM                    A
     C                   PARM                    B
     C                   PARM                    RESULT
     C                   EVAL      RESULT = A / B
     C                   SETON                                          LR
