     V*=====================================================================
     V* Test DO with factor 2 not specified
     V*=====================================================================
     C                   EVAL    *IN37=*OFF
     C     1             DO
     C      'Body'       DSPLY
     C                   ENDDO