     D DSTEMP          DS            64
     D VAIDOJ                  1     10A
     D VAATV0                 11     11A
     D VADATA                 12     19S 0
     D VANOME                 20     34A
     D VACDC                  35     49A
     D VACOD1                 50     64A
     C                   EVAL      VAIDOJ = 'A123456789'
     C     VAIDOJ        dsply
     C                   SETON                                        LR
