     D VERAPG          DS           823
     D V£IDOJ                  1     10A
     D V£ATV0                 11     11A
     D V£DATA                 12     19S 0
     D V£NOME                 20     34A
     D V£CDC                  35     49A
     D V£TIPO                 50     52A
     D V£ORE                  53     55P 2
     D V£VIAC                 56     58P 2
     D V£VIAS                 59     61P 2
     D V£KM                   62     64P 0
     D V£KMSE                 65     67P 0
     D V£PEDC                 68     73P 2
     D V£PEDS                 74     79P 2
     D V£RISC                 80     85P 2
     D V£RISS                 86     91P 2
     D V£ALBC                 92     97P 2
     D V£ALBS                 98    103P 2
     D V£SPEC                104    109P 2
     D V£SPES                110    115P 2
     D V£CAUS                116    118A
     D V£TCOM                119    119A
     D V£COM1                120    329A
     D V£COM2                330    539A
     D V£DIAR                540    542P 2
     D V£DIUS                543    545P 2
     D V£NFAT                546    555A
     D V£DFAT                556    560P 0
     D V£COD1                561    575A
     D V£COD2                576    590A
     D V£COD3                591    605A
     D V£COD4                606    620A
     D V£COD5                621    635A
     D V£COD6                636    650A
     D V£COD7                651    665A
     D V£COD8                666    680A
     D V£COD9                681    695A
     D V£COD0                696    710A
     D V£NUM1                711    721P 6
     D V£NUM2                722    732P 6
     D V£NUM3                733    743P 6
     D V£NUM4                744    754P 6
     D V£NUM5                755    765P 6
     D V£FL01                766    766A
     D V£FL02                767    767A
     D V£FL03                768    768A
     D V£FL04                769    769A
     D V£FL05                770    770A
     D V£FL06                771    771A
     D V£FL07                772    772A
     D V£FL08                773    773A
     D V£FL09                774    774A
     D V£FL10                775    775A
     D V£FL11                776    776A
     D V£FL12                777    777A
     D V£FL13                778    778A
     D V£FL14                779    779A
     D V£FL15                780    780A
     D V£FL16                781    781A
     D V£FL17                782    782A
     D V£FL18                783    783A
     D V£FL19                784    784A
     D V£FL20                785    785A
     D V£USIN                786    795A
     D V£DTIN                796    800P 0
     D V£ORIN                801    804P 0
     D V£USAG                805    814A
     D V£DTAG                815    819P 0
     D V£ORAG                820    823P 0
     C                   CLEAR                   £CRN1            15
     C                   EVAL      £CRN1='1'
     C                   MOVEL(P)  £CRN1         V£IDOJ
     C                   DSPLY                   V£IDOJ
     C                   SETON                                        LR
