     V* ==============================================================
     V* MODIFICHE Ril.  T Au Descrizione
     V* gg/mm/aa  nn.mm i xx Breve descrizione
     V* ==============================================================
     V* 26/03/21  V5R1    BONMAI Creazione
     V* ==============================================================
      *--------------------------------------------------------------------------------------------*
     D                 DS
     D£K10SK                       1050    DIM(200)
     D £K10S_NM                      50    OVERLAY(£K10SK:1)                    Nome
     D £K10S_VA                    1000    OVERLAY(£K10SK:*NEXT)                Valore
      *--------------------------------------------------------------------------------------------*
      * M A I N
      *--------------------------------------------------------------------------------------------*
     C                   EVAL      £K10S_NM(1)='AAAA'
     C                   EVAL      £K10S_VA(1)='BBBB'
     C     £K10S_NM(1)   DSPLY
     C     £K10S_VA(1)   DSPLY
      *
     C                   SETON                                        LR
      *--------------------------------------------------------------------------------------------*