     V* ==============================================================
     V* Data Area Write Test  
     V* ==============================================================
     D SCAATTDS        DS           460
     C     *DTAARA       DEFINE    C£C£E00D      SCAATTDS
     C                   EVAL      SCAATTDS='WRITTEN'
     C                   OUT       SCAATTDS
     C     SCAATTDS      DSPLY
     C                   SETON                                          LR