      *---------------------------------------------------------------
     D ECHO            S             40
      *---------------------------------------------------------------
     D* Main
      *---------------------------------------------------------------
     C     ECHO          DSPLY
     C                   SETON                                        LR
      *---------------------------------------------------------------
     C/COPY QILEGEN,£INZSR
      *---------------------------------------------------------------
     C     £INIZI        BEGSR
     C     *ENTRY        PLIST
     C                   PARM                    ECHO
     C                   ENDSR
      *---------------------------------------------------------------
