      * ------------------------------------------------------------------
     DinTxt            S             52
      * ------------------------------------------------------------------
     C     *entry        plist
     C                   parm                    inTxt            52
     C     inTxt         dsply
     C                   seton                                        LR
