      *----------------------------------------------------------------------
     D INPUT           S             50
      *----------------------------------------------------------------------
     C     *ENTRY        PLIST
     C                   PARM                    INPUT
      *
     C                   EVAL        INPUT='ECHO_PGM'
      *
     C                   SETON                                        LR
      *----------------------------------------------------------------------
