     V*=====================================================================
     V*  Tests for %EDITW
     V*=====================================================================
     D*----------------------------------------------------------------
     D DSP             S             50
      *
     D  N              S              6  2
     D  D6             S              6  0
      *
      *
     C*----------------------------------------------------------------
  019C                   EVAL      N=123.4
  061C                   EVAL      DSP='x' + %EDITW(N:' 0    ')
     C     DSP           DSPLY
     C*----------------------------------------------------------------
  019C                   EVAL      D6=011299
  061C                   EVAL      DSP='x' + %EDITW(D6:'  /  /  ')
     C     DSP           DSPLY
     C*----------------------------------------------------------------
     C                   SETON                                        LR