     V*=====================================================================
     V*  Tests for %EDITW
     V*=====================================================================
     D*----------------------------------------------------------------
     D DSP             S             50
      *
     D  N              S              6  2
     D  D6             S              6  0
      *
     C*----------------------------------------------------------------
     C                   EVAL      D6=082345
     C                   EVAL      DSP='x' + %EDITW(D6:'0  :  :  ')
     C     DSP           DSPLY
     C*----------------------------------------------------------------
     C                   SETON                                        LR