     D NBR             S              8  0
     D RESULT          S             50
     C     *ENTRY        PLIST
     C                   PARM                    NBR
     C                   EVAL      RESULT = %char(%int(10 / NBR))
     C     RESULT        DSPLY
     C                   SETON                                        LR
