      /COPY QILEGEN,£PDS
      /COPY QILEGEN,£C5PDS

      /API QILEGEN,ERROR53_API

     C                   EVAL      £UDO2F = 'FOO'
     C                   EVAL      U$FUW2 = 'BAR'
     C     £UDO2F        DSPLY
     C     U$FUW2        DSPLY