     V* ==============================================================
     D* This program call a copy containing error
     V* ==============================================================
     D x               S              8  0
     D n               S              8  0
     I/COPY QILEGEN,CPERR02
     C                   SETON                                        LR
      *--------------------------------------------------------------*
