     V* ==============================================================
     D* 25/11/24
     D* Purpose: Must fire the following errors during execution of
     D* line 7 - 241122 cannot be assigned to RES of type NumberType(entireDigits=4, decimalDigits=0, rpgType=)
     V* ==============================================================
     D SRC             S              6  0 INZ(241122)
     C                   Z-ADD     SRC           RES               4 0