     V* ==============================================================
     D* 02/12/24
     D* Purpose: Must fire the following errors during execution of
     D* line 6 - Data reference *IN10 not resolved
     V* ==============================================================
     C     *LIKE         DEFINE    *IN10         XIN10
