     V* ==============================================================
     D* This program force a parsing error at line 6
     V* ==============================================================
     D x               S              8  0
     D n               S              8  0
      C                   EVAL      x = 1 / n
     C                   SETON                                        LR
      *--------------------------------------------------------------*
