     V* ==============================================================
     D* Subroutine £MYSUB not resolved test
     D* Jariko must fire two error events:
     D*  - data reference not resolved £MYVAR at line 7
     D*  - subroutine call not resolved £MYSUB at line 8
     V* ==============================================================
     C                   MOVEL(P)  'D1'          £MYVAR1
     C                   EXSR      £MYSUB