     V* ==============================================================
     D* Compile time errors.
     D* This program contains three errors in D specifications
     D* Jariko must fire an ErrorEvent for each error
     V* ==============================================================
     D £40TDS          DS                  INZ
     D  £40TIN                         Z
     D  £40TFI                         Z

     D B£FIND        E DS                  EXTNAME(B£FIND0F)
     D XOGG            S                   LIKE(B1TIP2)
     D XCOD            S                   LIKE(B1COD2)
     D XDES            S                   LIKE(B1DESC)
      *--------------------------------------------------------------*
