     V* ==============================================================
     D* Data references errors
     D*
     V* ==============================================================
     C     E_LISPAR      BEGSR
     C                   CLEAR                   C£ESO0
     C                   EVAL      P£TPRC=P_RxATT(£UIBD1:'P£TPRC(':' ')
     C                   EVAL      P£CD01=P_RxATT(£UIBD1:'P£CD01(':' ')
     C                   ENDSR
      *--------------------------------------------------------------*
