     V* ==============================================================
     D* Reload metadata not found error
     D*
     V* ==============================================================
     FBRARTI0L  IF   E           K DISK
     C                   EVAL      A§ARTI = 'I am ok'
      *--------------------------------------------------------------*
