     V* ==============================================================
     D* This program call a copy containing error
     V* ==============================================================
     D x               S              8  0
     D n               S              8  0
     I/COPY QILEGEN,ERROR01
     C                   EVAL      x = 1 / n
     C                   SETON                                        LR
      *--------------------------------------------------------------*
