     V* ==============================================================
     D* 21/11/24
     D* Purpose: Must fire the following errors during execution of
     D* line 9 - 10 cannot be assigned to I of type NumberType(entireDigits=1, decimalDigits=0, rpgType=)
     V* ==============================================================

     D I               S              1  0
     
     C                   EVAL      I=10
