     V* ==============================================================
     D* Missing implementation of the DOWLE opcode
     D*
     V* ==============================================================     
     C     $B            DOWLE     13
     C                   ENDDO