     V* ==============================================================
     D* 01/08/24  nn.mm lanmam
     D* Purpose: SyntaxChecking with compile must show bot
     D* "missing sympol implementation" and "data reference not resolved"
     D* errors
     D* Expected errors at line:
     D* 9 and 10
     V* ==============================================================
     C     MSG           DSPLY
     C                   ABCDE