     D x               S              8  0
     D n               S              8  0
     C                   EVAL      x = 1 / n
     C                   SETON                                        LR
      *--------------------------------------------------------------*
