     V* ==============================================================
     D* Stackoverflowexception evaluation
     D*
     V* ==============================================================
      *
      * The stackoverflowexception is thrown when I have more than 1
      * DEFINE statement related to not found D specs.
      * In this case KTPOR and KCDOR are not found.
     C     *LIKE         DEFINE    S5TPOR        KTPOR
     C     *LIKE         DEFINE    S5CDOR        KCDOR

     C     'HI'          DSPLY
     