     V* ==============================================================
     D* Operations at line 6 and 9 are not implemented
     D*
     V* ==============================================================
     C     IMP0          BEGSR
     C/EXEC SQL
     C+ DECLARE C1 CURSOR FOR S1
     C/END-EXEC
     C/EXEC SQL
     C+ DECLARE C2 CURSOR FOR S2
     C/END-EXEC
     C                   ENDSR
      *--------------------------------------------------------------*
