     V* ==============================================================
     D* 02/05/24
     D* Purpose: Test the right behavior in terms of error position
     D* when an error occurs inside an included API
     V* ==============================================================

      /API APIERR1

      * Display MSG that not exists
     C     MSG           DSPLY

     