     D$X               S              2  0
     D $STRUCT         DS
     D  $ARR                          2P 0 DIM(10) INZ
     C                   EVAL      $X = 0
     C                   EVAL      $ARR($X) = 1