     V* ==============================================================
     D* 09/05/24
     D* Purpose: Must fire the following errors
     D* line 10 - MSG not resolved
     D* line 11 - DUMMY not implemented
     V* ==============================================================

      /API APIMATH

     C     MSG           DSPLY
     C                   DUMMY

     