     V* ==============================================================
     D* Better displaying of lexical errors
     D*
     V* ==============================================================     

     D WFUND1          DS
     D  WSDATA                         8  0