     V* ==============================================================
     D* 25/07/24
     D* Purpose: Must fire the following errors
     D* line 11 - Factor 2 as character
     V* ==============================================================

     D FOO             S              1

     C                   SETON                                            36
     C                   EVAL      FOO = 'B'
     C                   MOVE      FOO           *IN36