     V* ==============================================================
     D* Errors in block statements
     D*
     V* ==============================================================
     C     £G90          BEGSR
     C                   IF        '1' = '1'
     C                   CALL      £G90PG                               37      B£G90G
     C     *IN35         PARM      AAAA          £G9035            1
     C     *IN36         PARM      AAAA          £C£F36            1
     C                   ENDIF
     C                   ENDSR
     C                   IF        '1' = '1'
     C                   CALL      £G90PG                               37      B£G90G
     C     *IN35         PARM      AAAA          £G9035            1
     C     *IN36         PARM      AAAA          £C£F36            1
     C                   ENDIF
      *--------------------------------------------------------------*
