     D VAL             S              3  0
     D RES             S              3  0

     C                   EVAL      VAL=10

     C                   EVAL      RES = 24 * VAL + 6
     C     RES           DSPLY

     C                   EVAL      RES=24 * VAL + 6
     C     RES           DSPLY


     C                   EVAL      RES=24* VAL + 6
     C     RES           DSPLY

     C                   EVAL      RES = 24* VAL + 6
     C     RES           DSPLY

     C                   EVAL      RES=24*VAL+6
     C     RES           DSPLY

     C                   EVAL      RES=24*VAL+6
     C     RES           DSPLY