      * Called by 'EXCPCALLER', see it for more details on this test
     C     *ENTRY        PLIST
     C                   PARM                    $A                1
