     D COUNT           S              2  0
     C                   FOR       COUNT = 12 DOWNTO 2 BY 3
     C     COUNT         DSPLY
     C                   ENDFOR
     C                   SETON                                        LR
      *--------------------------------------------------------------*
