     D Msg             S             12
     C                   Eval      Msg  = 'Ciao!'
      *
      /FREE
        Msg = 'Hello world';
        dsply Msg;
      /END-FREE