***************************************************************************
     C     'Hello!'      dsply
     C                   SETON                                          LR
