     V* ==============================================================
     V* 29/11/2024 APU002 Creation
     V* ==============================================================
    O * PROGRAM GOAL
    O * Execute a GOTO into an IF with an ELSE IF body
     V* ==============================================================
     C                   GOTO      BGN
     C                   IF        *OFF
     C     'ko'          DSPLY
     C                   ELSEIF    *OFF
     C     BGN           TAG
     C     'ok'          DSPLY
     C                   ELSE
     C     'ko'          DSPLY
     C                   ENDIF
