     V* ==============================================================
     V* 25/11/2024 APU002 Creation
     V* ==============================================================
    O * PROGRAM GOAL
    O * Being called by 'GOTOTST10.rpgle'
     V* ==============================================================
     C                   GOTO      TAG1
     C     'ko'          DSPLY
     C     TAG1          TAG
     C     'ok'          DSPLY