     D COUNT           S              1  0 INZ(0)
     C     START         TAG
     C                   EVAL      COUNT += 1
     C     COUNT         DSPLY
     C                   IF        COUNT <= 3
     C                   GOTO      START
     C                   ENDIF
     C                   SETON                                        LR
