     D msg             S             12
     C                   Eval      MSG  = 'Hello World!'
     C                   dsply                   Msg
     C                   SETON                                          LR
