     D Msg             S             12
     C                   Eval      Msg  = %TRIM(' Hello World! ')
     C                   dsply                   Msg
     C                   SETON                                          LR
