     D Msg             S             12
     C     Msg           dsply
     C                   SETON                                          LR
     C     *entry        plist
     C                   parm                    msg
