      *---------------------------------------------------------------
      * Program containing *INZSR subroutine that display HELLO IN LR
      * HELLO IN LR has to be printed every times this program is called
      *---------------------------------------------------------------
     D  MSG            S             50
     C                   SETON                                          LR
      *--------------------------------------------------------------*
    RD* Initialization routine
      *--------------------------------------------------------------*
     C     *INZSR        BEGSR
     C                   EVAL      MSG='HELLO IN LR'
     C                   DSPLY                   MSG
     C                   ENDSR
