      *---------------------------------------------------------------
      * Call twice INZSR_INRT and INZSR_INLR
      * Expected: 'HELLO IN RT' displayed once
      *           'HELLO IN LR' displayed twice
      *---------------------------------------------------------------
     C                   CALL      'INZSR_INRT'
     C                   CALL      'INZSR_INRT'
     C                   CALL      'INZSR_INLR'
     C                   CALL      'INZSR_INLR'
     C                   SETON                                          RT

