     D Msg             S             52
     D X               S             23    INZ('abc')
     C                   Eval      Msg  = 'Hello World! ' + %CHAR(%LEN(X))
     C                   dsply                   Msg
     C                   SETON                                          LR
