     D FIRST           DS            10
     D  FIRST_F1                                 LIKE(SECOND_F1)

     D SECOND          DS            10
     D  SECOND_F1                    10