      /COPY QILEGEN,LIKEWITHCOPY_DEP
     D FOO             S                   LIKE(BAR)
     D BAZ             S           2560    VARYING

     C     'OK'           DSPLY
