     D FOO             S                   LIKE(BAR)
     D BAZ             S           2560    VARYING
      /COPY QILEGEN,LIKEWITHCOPY_DEP

     C     'OK'           DSPLY
