     V* ==============================================================
     D* This program executes some mock OPEN statement
     V* ==============================================================
     FPRT198    O    F  198        PRINTER OFLIND(*INOF) USROPN
     C                   OPEN      PRT198
     OPRT198    E            E1WRIT      1