     D ARRA1           S              4    DIM(3)
     D i               S              1  0
     **-------------------------------------------------------------------
     C                   EVAL      ARRA1='ABCD'
     C                   FOR       i = 1 TO 3
     C                   DSPLY                   ARRA1(i)
     C                   ENDFOR
     C                   MOVEA     *BLANKS       ARRA1
     C                   FOR       i = 1 TO 3
     C                   DSPLY                   ARRA1(i)
     C                   ENDFOR
     **-------------------------------------------------------------------
     C                   SETON                                          LR
