     D ARR1            S             20    DIM(10) ctdata perrcd(1)
     D XXSTR           S             10    INZ('ABCDEFGHIL')
     D i               S              2  0
     **-------------------------------------------------------------------
     C                   MOVEA(P)  XXSTR         ARR1
     C                   FOR       i = 1 TO 10
     C                   DSPLY                   ARR1(i)
     C                   ENDFOR
     **-------------------------------------------------------------------
     C                   SETON                                          LR
**CTDATA ARR1
ABCDEFGHILMNOPQRSTOV
ABCDEFGHILMNOPQRSTOV
ABCDEFGHILMNOPQRSTOV
ABCDEFGHILMNOPQRSTOV
ABCDEFGHILMNOPQRSTOV
ABCDEFGHILMNOPQRSTOV
ABCDEFGHILMNOPQRSTOV
ABCDEFGHILMNOPQRSTOV
ABCDEFGHILMNOPQRSTOV
ABCDEFGHILMNOPQRSTOV
