     D X               S              2  0 inz(0)
     **-------------------------------------------------------------------
     C                   MOVE      *LOVAL        X
     C     X             DSPLY
     **-------------------------------------------------------------------
     C                   SETON                                          LR
