     Dvar5             S              5    inz('abcde')
     Dmsg              S             50
     C                   moveL     *all'a'       var5
     C                   Eval      msg = var5
     C     msg           dsply
      ***********************************************
     C                   SETON                                          LR
