     D ARRX            S              2    DIM(5) ctdata perrcd(5)
     D ARRY            S              3    DIM(5) ctdata perrcd(5)
     D i               S              1  0
     **-------------------------------------------------------------------
     C                   MOVEA     ARRX          ARRY(2)
     C                   FOR       i = 1 TO 5
     C                   DSPLY                   ARRY(i)
     C                   ENDFOR
     **-------------------------------------------------------------------
     C                   SETON                                          LR
**CTDATA ARRX
1234567890
**CTDATA ARRY
AAABBBCCCDDDEEE
