     D ARRX            S              2    DIM(5) ctdata perrcd(5)
     D VALY            S             15    INZ('ABCDEFGHILMNOPQ')
     D i               S              1  0
     **-------------------------------------------------------------------
     C                   MOVEA     ARRX(2)       VALY
     C                   DSPLY                   VALY
     **-------------------------------------------------------------------
     C                   SETON                                          LR
**CTDATA ARRX
1234567890
