     D AAA006          S              6
     C                   EVAL      AAA006='  AAA'
     C                   MOVEL     784.25        AAA006            6
     C     AAA006        dsply
      ***********************************************
     C                   SETON                                          LR
