     Dvar2d3           S              5  3 inz(11.111)
     Dvar4d1           S              5  1 inz(0)
     Dmsg              S             50
     C                   moveL     var2d3        var4d1
     C                   Eval      msg = %Char(var4d1)
     C     msg           dsply
      ***********************************************
     C                   SETON                                          LR
