     Dvar5             S              5  0 inz(12345)
     Dmsg              S             50
     C                   moveL     *zeros        var5
     C                   moveL     *zero         var5
     C                   Eval      msg = %Char(var5)
     C     msg           dsply
      ***********************************************
     C                   SETON                                          LR
