     D ARRX            S              2    DIM(5) ctdata perrcd(5)
     D ARRY            S              3    DIM(4) ctdata perrcd(4)
     D i               S              1  0
     **-------------------------------------------------------------------
     C                   MOVEA     ARRX          ARRY
     C                   FOR       i = 1 TO 4
     C                   DSPLY                   ARRY(i)
     C                   ENDFOR
     **-------------------------------------------------------------------
     C                   SETON                                          LR
**CTDATA ARRX
1234567890
**CTDATA ARRY
AAABBBCCCDDD
