     Dvar5             S              5A   inz('ABCDE')
     Dvar10            S             10A   INZ('0123456789')
     Dvar15            S             15A   INZ('FGH')
     Dvar1             S              1A   INZ('X')
     Dfix5a            S              5A   INZ('MNOPQ')
     Dfix5b            S              5A   INZ('MNOPQ')
     Dfix5c            S              5A   INZ('MNOPQ')
     Dfix5d            S              5A   INZ('MNOPQ')
     C                   move      var5          fix5a
     C     fix5a         dsply
      ***********************************************
     C                   move      var10         fix5b
     C     fix5b         dsply
      ***********************************************
     C                   move      var15         fix5C
     C     fix5C         dsply
      ***********************************************
     C                   move      var1          fix5d
     C     fix5d         dsply
      ***********************************************
     C                   SETON                                          LR
