     Dvar5             S              5  0 inz(12345)
     Dvar8             S              8  0 INZ(12345678)
     Dvar15            S             15  0 INZ(123)
     Dvar1             S              1  0 INZ(1)
     Dfix5a            S              5  0 INZ(99999)
     Dfix5b            S              5  0 INZ(99999)
     Dfix5c            S              5  0 INZ(99999)
     Dfix5d            S              5  0 INZ(99999)
     C                   move      var5          fix5a
     C     fix5a         dsply
      ***********************************************
     C                   move      var8          fix5b
     C     fix5b         dsply
      ***********************************************
     C                   move      var15         fix5C
     C     fix5C         dsply
      ***********************************************
     C                   move      var1          fix5d
     C     fix5d         dsply
      ***********************************************
     C                   SETON                                          LR
