     Dmsg              S             50
     C                   Eval      msg = 'Ciao'
     C                   moveL     *blank        msg
     C     msg           dsply
      ***********************************************
     C                   SETON                                          LR
