     C                   SELECT
     C     £CRNFU        WHENEQ    'GES'
     C     £CRNFU        OREQ      'VIS'
     C     '01'          DSPLY
     C                   OTHER
     C     '02'          DSPLY
     C                   ENDSL
      *
     C                   MOVEL     *BLANKS       £CRNFU           10
     C                   SETON                                          LR

