     D X               S              2  0 inz(0)
     D Msg             S             50
     **-------------------------------------------------------------------
     C                   MOVE      *LOVAL        X
     C                   EVAL      Msg = %CHAR(X)
     C     X             DSPLY
     **-------------------------------------------------------------------
     C                   SETON                                          LR
