     C                   MOVEL(P)  'XXXXX'       VAR1              5
     C                   dsply                   VAR1
     C                   MOVEL     'YYYYY'       VAR2              5
     C                   dsply                   VAR2
     C                   SETON                                          LR
