     D ARRA1           S              4    DIM(2)
     D i               S              1  0
     **-------------------------------------------------------------------
     C                   EVAL      ARRA1='ABCD'
     C                   FOR       i = 1 TO 2
     C                   DSPLY                   ARRA1(i)
     C                   ENDFOR
     C                   MOVEA     '123456789'   ARRA1
     C                   FOR       i = 1 TO 2
     C                   DSPLY                   ARRA1(i)
     C                   ENDFOR
     **-------------------------------------------------------------------
     C                   SETON                                          LR
