     C                   EXSR      F_CALL
      *
     C                   SETON                                        RT
      *---------------------------------------------------------------------
    RD* Routine test SORTA
      *---------------------------------------------------------------------
     C     F_CALL        BEGSR
     C                   DO        100
     C                   CALL      'MUTE10_01B'
     C                   ENDDO
     C                   ENDSR
