     Dx                S              7  0 Inz(-0123456)
     C                   IF        x < 0
     C     '< 0'         dsply
     C                   ELSE
     C     '> = 0'       dsply
     C                   ENDIF
     *********************************************************************
     C                   Seton                                        LR
