     DConditionVar     S               N   INZ('0')
     C                   if        not ConditionVar
     C     'NotCondition'dsply
     C                   else
     C     'Condition'   dsply
     C                   endif
     C                   SETON                                          LR
