     D P1              S              2  0
     D P2              S              2  0
     D PARMS           S              2  0
      *---------------------------------------------------------------
      * Main
      *---------------------------------------------------------------
     C     *ENTRY        PLIST
     C                   PARM                    P1
     C                   PARM                    P2
      *
     C                   EVAL      PARMS=%PARMS
     C     PARMS         DSPLY
      *
     C                   SETON                                        LR
      *---------------------------------------------------------------
