     D                SDS
     D  £PDSSU                 1     10    INZ('HELLO')
     D  £PDSPR           *PARMS
     D  £PDSST           *STATUS

     D U$FUNZ          S             10
     D U$METO          S             10

     C     £PDSSU        DSPLY
     C     £PDSPR        DSPLY
     C     £PDSST        DSPLY


     C     *ENTRY        PLIST
     C                   PARM                    U$FUNZ
     C                   PARM                    U$METO