     D                SDS
     D  £PDSSU                 1     10
     D  £PDSPR           *PARMS
     D  £PDSPR           *STATUS


     C     £PDSSU        DSPLY