      *---------------------------------------------------------------
      * Main
      *---------------------------------------------------------------
      *
     C                   CALL      'PGM_C'
     C                   PARM      'INZ'         P1               15
     C                   PARM      *BLANK        P2               30
      *
     C     P1            DSPLY
     C     P2            DSPLY
      *
     C                   SETON                                        RT
      *---------------------------------------------------------------

