      *---------------------------------------------------------------
      * Main
      *---------------------------------------------------------------
      *
     C                   CALL      'PGM_B'
      *
     C                   SETON                                        LR
      *---------------------------------------------------------------
