     D Msg             S             50
     D i               S              2  0 inz(0)
     C                   Eval      i += 3
     C                   Eval      i += 3
     C                   Eval      Msg  = 'COUNTER IS NOW ' + %char(i)
     C                   dsply                   Msg
     C                   SETON                                          LR
