     D Msg             S             50
     D i               S              2  0 inz(2)
     C                   Eval      i = i ** 3
     C                   Eval      Msg  = 'i is now ' + %char(i)
     C                   dsply                   Msg
     C                   SETON                                          LR
