      *---------------------------------------------------------------
      * A very simple procedure declaration
      *---------------------------------------------------------------
     DCALL1            PR
      *---------------------------------------------------------------
      * Main
      *---------------------------------------------------------------
     C                   SETON                                        LR
      *---------------------------------------------------------------
     PCALL1            B
     DCALL1            PI
     C     'Done!'       DSPLY
     PCALL1            E
      *---------------------------------------------------------------