      * Called by PRSLTCALLER.rpgle
      * Takes $A as parameter and updates it's value
     C     *ENTRY        PLIST
     C                   PARM                    $A                1
     C                   EVAL      $A = *ON