      * Called by PRSLTCALLERDUPLICATE.rpgle
     C     *ENTRY        PLIST
     C                   PARM                    $A                1
     C                   PARM                    $B                1
     C                   PARM                    $C                1
     C                   EVAL      $A = *ON
     C                   EVAL      $B = *OFF