      *      PERSONALIZZAZIONE A£LING
     D A£1$DS          DS           100
      * N° 03 - Suffisso exit ambiti V3 SA£TR00_    1    5
     D  T$A£1F                 6      6
      * N° 04 - Precompila traduz.   V2 SI/NO       1    2
     D  T$A£1H                 9      9
      * N° 05 - Estraz.automatica    V2 SI/NO       1
     D  T$A£1I                10     10
      * N° 06 - Exit estrazione      V3 SA£TR01_    2
     D  T$A£1J                11     12
      * N° 07 - Exit trace           V3 SA£A£BT_    2
     D  T$A£1K                13     14
