     D Msg             S             50
     D NU              S              2  0 DIM(2)
     D I               S              1  0 INZ(2)
     C                   z-add     5             NU(i)
     C     NU(i)         DSPLY
     C                   SETON                                        LR
