     C     'Starting'    dsply       
     C     'A'           IFEQ      'A'
     C                   return
     C                   ENDIF     
     C     'Done'        dsply
     C                   SETON                                          LR
