     C     'Starting'    dsply
     C                   return
     C     'Done'        dsply
     C                   SETON                                          LR
