     D Msg             S             50
     D  N1             S              9  0
     C                   EVAL        N1 = 34,77
     C                   IF          N1 = 34
     C     '34'          DSPLY
     C                   ELSEIF    N1 = 35
     C     '35'          DSPLY
     C                   ELSE
     C     'Epic fail'   DSPLY
     C                   ENDIF
     C                   SETON                                        LR
