     D A               S              1
     D B               S              1

     C                   EVAL      A='A'
     C                   EVAL      B='B'
     C                   CALL      'RTCALLEEERR'                        37
     C     *IN37         DSPLY

     C                   SETON                                          LR