     H ACTGRP('MYACT')

     D C               S              1
     D D               S              1

     C                   EVAL      C='C'
     C                   EVAL      D='D'
     C     1             DIV       0             RESULT            9 0
     C     'HI'          DSPLY

     C                   SETON                                        RT