     D NBR             S              8  0
     D RESULT          S             50
     C     *ENTRY        PLIST
     C                   PARM                    NBR
     C                   IF        NBR = 1
     C                   SETON                                        LR
     C                   ELSE
     C                   SETON                                        RT
     C                   ENDIF
