     D Msg             S             12
     D Arr             S              1  0 DIM(7)
     D I               S              1  0
     C                   Eval      Arr(1) = 8
     C                   Eval      Arr(2) = 9
     C                   Eval      Arr(3) = 4
     C                   Eval      Arr(4) = 6
     C                   Eval      Arr(5) = 5
     C                   Eval      Arr(6) = 1
     C                   Eval      Arr(7) = 0
     C                   SORTA     Arr
     C                   FOR       i = 1 to 7
     C     Arr(i)        dsply
     C                   ENDFOR
     C                   SETON                                          LR
