     D RESULT          S             50
     D STRING          S             50
      *--------------------------------------------------------------*
     C                   EVAL      STRING = 'My;Name;Is;Marco'
     C                   EVAL      RESULT = %SPLIT(STRING : ';')
      *
     C     RESULT        DSPLY
      *--------------------------------------------------------------*