     D RESULT          S             50
     D VALUE           S             50
      *--------------------------------------------------------------*
     C                   EVAL      VALUE = 'Hello;World'
     C                   EVAL      RESULT = %SPLIT(VALUE : ';')
      *
     C     RESULT        DSPLY
      *--------------------------------------------------------------*