     D SQL_DAT         DS

     C                   EXSR      EXEC_SQL
     C                   SETON                                          LR

     C     EXEC_SQL      BEGSR
     C/EXEC SQL
     C+ FETCH C1 INTO :SQL_DAT
     C/END-EXEC
     C                   ENDSR