     D msg             S             12
     C                   Eval      MSG  = %char(%SQRT(239874))
     C                   dsply                   Msg
     C                   SETON                                          LR
