     **-------------------------------------------------------------------
     D Msg             S             10
     **-------------------------------------------------------------------
     C                   MOVEL     *ALL'W'       Msg
     C     Msg           DSPLY
     **-------------------------------------------------------------------
     C                   SETON                                          LR
