     **-------------------------------------------------------------------
     D X               S              5  0 inz(0)
     **-------------------------------------------------------------------
     C                   Z-ADD     *ALL'51'      X
     C     X             DSPLY
     **-------------------------------------------------------------------
     C                   SETON                                          LR
