     D STR1            S              4
     D STR2            S              4
     D STR3            S              4
     D MSG             S             12
     **-------------------------------------------------------------------
     C                   EVAL      STR1 = 'AB'
     C                   EVAL      STR2 = 'CD'
     C                   EVAL      STR3 = 'EF'
     C                   EVAL      MSG = STR1 + STR2 + STR3
     C                   DSPLY                   MSG
     **-------------------------------------------------------------------
     C                   SETON                                          LR
