     D Res             S             10  0
      *
     C     D'2010-02-01' Subdur    D'1900-01-01' Res:*D
     C     Res           DSPLY
      *
     C                   SETON                                        LR
