     D i               S              3S 0 INZ(20)
     D x               S              2S 1 inz(0.1)
     D r               S              4S 1
     D Msg             S             10
     *********************************************************************
     C                   EVAL      r = i + x
     C                   eval      Msg = %CHAR(r)
     C     Msg           dsply
     *********************************************************************
     C                   EVAL      r = i - x
     C                   eval      Msg = %CHAR(r)
     C     Msg           dsply
     *********************************************************************
     C                   EVAL      r = i * x
     C                   eval      Msg = %CHAR(r)
     C     Msg           dsply
     *********************************************************************
     C                   EVAL      r = i / x
     C                   eval      Msg = %CHAR(r)
     C     Msg           dsply
     *********************************************************************
     C                   SETON                                          LR
