     D TIMEST          S               Z
      *
      * Expected '0001-01-01-00.00.00.000000'
     C     TIMEST        DSPLY
      *
     C                   TIME                    TIMEST
      * Expected Actual Timestamp
     C     TIMEST        DSPLY
      *
     C                   CLEAR                   TIMEST
      * Expected '0001-01-01-00.00.00.000000'
     C     TIMEST        DSPLY
      *
     C                   SETON                                        LR