      *----------------------------------------------------------------------
     D INPUT           S             50
      *----------------------------------------------------------------------
     C     *ENTRY        PLIST
     C                   PARM                    INPUT
      *
     C                   EVAL        INPUT=%TRIM(INPUT)+'!!!'
      *
     C                   SETON                                        LR
      *----------------------------------------------------------------------
