     D msg             S             50
     C                   Eval      MSG  = %TRIMR('Hello world!   ')
     C     Msg           dsply
     C                   Eval      MSG  = %TRIMR('Hello world!': 'd!')
     C     Msg           dsply
     C                   Eval      MSG  = %TRIMR('Hello world!!!': '!')
     C     Msg           dsply
     C                   SETON                                          LR
