     D msg             S             50
     C                   Eval      MSG  = %TRIML('  Hello world!')
     C     Msg           dsply
     C                   Eval      MSG  = %TRIML('Hello world!': 'He')
     C     Msg           dsply
     C                   Eval      MSG  = %TRIML('HHHHHello world!': 'H')
     C     Msg           dsply
     C                   SETON                                          LR
