     V* ==============================================================
     D* Include copy as C spec
     V* ==============================================================
     D MSGCPY          S             30
  T > /COPY QILEGEN,TSTCPY02