     V* ==============================================================
     D* Include copy as D spec
     V* ==============================================================
     D MSGCPY          S             30
     D/COPY QILEGEN,TSTCPY01