     V* ==============================================================
     D* Include not found copy
     V* ==============================================================
     D MSGCPY          S             30
  T > /COPY XXX,YYY