     V* ==============================================================
     D* Program that includes a copy with this character § in the name
     V* ==============================================================
     D MSGCPY          S             30
  T > /COPY QILEGEN,CP§01