     V* ==============================================================
     D* Include copy as C spec
     V* ==============================================================
     D MSGCPY          S             30
     C/COPY QILEGEN,TSTCPY01