     V* ==============================================================
     D* Copy that includes another copy twice
     V* ==============================================================
     D MSGCPY          S             30
  T > /COPY QILEGEN,TSTCPY02
  T > /COPY QILEGEN,TSTCPY02