     D LEN_PIPE        S              5  0 INZ(10)
     D LEN             S              5  0
     C                   EVAL      LEN=LEN_PIPE
     C                   DSPLY                   LEN
