     D £DBG_Str        S             2
     D P1              S             10

     C                   EVAL      P1='hello'

     C                   CALL      'VPARMSCALLEE'
     C                   PARM                    P1