     D £DBG_Str        S             2

     D £40A            S             15    DIM(300)

     C                   CALL      'VPARMSCALLEE'
     C                   PARM                    £40A

     C                   EVAL      £DBG_Str='ok'
     C     £DBG_Str      DSPLY