     D P1              S             10
     D P2              S             10

     D                SDS
     D  £PDSPR           *PARMS


     C     *ENTRY        PLIST
     C                   PARM                    P1
     C                   PARM                    P2

     C     £PDSPR        DSPLY