     C                   SELECT
     C     0             WHENEQ    1
     C     3             OREQ      3
     C     1             ANDEQ     5
     C     9             ANDEQ     9
     C     6             OREQ      7
     C     'First'       DSPLY
     C                   OTHER
     C     'Other'       DSPLY
     C                   ENDSL
      ********************************************************************
     C                   SELECT
     C     0             WHENEQ    1
     C     1             OREQ      1
     C     1             ANDEQ     1
     C     'First'       DSPLY
     C                   OTHER
     C     'Other'       DSPLY
     C                   ENDSL
     C                   SETON                                          LR
