     D ARRX            S              3  1 DIM(5) ctdata perrcd(1)
     D i               S              1  0
     D Msg             S             10
     **-------------------------------------------------------------------
     C                   XFOOT     ARRX          Total             3 1
     C                   EVAL      Msg = %char(Total)
     C                   DSPLY                   Msg
     **-------------------------------------------------------------------
     C                   SETON                                          LR
**CTDATA ARRX
011
022
100
010
010
