     **-------------------------------------------------------------------
     D X               S              5  0 inz(0)
     D Msg             S             50
     **-------------------------------------------------------------------
     C                   Z-ADD     *ALL'51'      X
     C                   EVAL      Msg = %CHAR(X)
     C     X             DSPLY
     **-------------------------------------------------------------------
     C                   SETON                                          LR
