     D C               S              2  0 INZ(1)
     C                   Z-ADD      5            A                 2 0
     C                   Z-ADD     11            B                 2 0
     C                   Z-ADD     88            C
     C     A             DSPLY
     C     B             DSPLY
     C     C             DSPLY
     C                   SETON                                          LR
