     *****    This program should not compile for a mismatch in X definition
     D X               S              8  0 INZ(1)
     C                   Z-ADD     88            X                 2 0
     C     X             DSPLY
     C                   SETON                                          LR
