     D X               S              2  0 INZ(1)
     C                   Z-ADD     88            X                 2 0
     C     X             DSPLY
     C                   SETON                                          LR
