     Da                S              2  0
     Db                S              2  0
     Dc                s              2  0
      *
     C                   Z-ADD     11            a                 2 0
     C                   Z-ADD     22            b                 2 0
     C                   Z-ADD     *zeros        c                 2 0
     C                   EVAL      c=a+b
     C     c             DSPLY
     C                   SETON                                        LR
