     D* ==============================================================
     D* Purpose of this source is testing if we are able to create AST
     D* for sources containing just D specifications and nothing other
     D* Original source: £MU1DS
     D* ==============================================================
      *
      * DS Output
      * -----------
     D£MU1DSI          DS           512
      * Function
     D £MU1I_FU                      10
      * Method
     D £MU1I_ME                      10
      * First field (alfa)
     D £MU1I_A1                      15
      * Second field (num)
     D £MU1I_N1                      15  5
      *
      * DS Output
      * ------------
     D£MU1DSO          DS           512
      * First field (alfa)
     D £MU1O_A1                      15
      * Second field (num)
     D £MU1O_N1                      15  5
      * Indicator 35
     D £MU1O_35                       1N
      *
