     D* ==============================================================
     D* Purpose of this source is testing if we are able to create AST
     D* for sources containing just C specifications and nothing other
     D* Original source: £MU1
     D* ==============================================================
     C     £MU1          BEGSR
      *
     C                   CALL      '£MU1API'
     C                   PARM                    £MU1DSI
     C                   PARM                    £MU1DSO
      *
     C                   EVAL      *IN35=£MU1O_35
      *
     C                   ENDSR
