     V* ==============================================================
     D* forced error: XXXXX does not exist as operator code
     V* ==============================================================
     C     MSG           XXXXX