     D R               S             10  3                                       Result
      *
    MU* VAL1(R) VAL2(21.5) COMP(EQ)
     C                   EVAL      R = 10 - 2 / 4 + 3 * 4
      *
     C                   SETON                                        LR