     D R               S             10  3                                       Result
      *
    MU* VAL1(R) VAL2(6.468) COMP(EQ)
     C                   EVAL      R = 3.234 * 2
      *
    MU* VAL1(R) VAL2(6.700) COMP(EQ)
     C                   EVAL      R = 3.350 * 2
      *
    MU* VAL1(R) VAL2(5.357) COMP(EQ)
     C                   EVAL      R = 3.234 + 2.123
      *
    MU* VAL1(R) VAL2(3.400) COMP(EQ)
     C                   EVAL      R = 3.299 + 0.101
      *
    MU* VAL1(R) VAL2(1.111) COMP(EQ)
     C                   EVAL      R = 3.234 - 2.123
      *
    MU* VAL1(R) VAL2(3.400) COMP(EQ)
     C                   EVAL      R = 3.402 - 0.002
      *
    MU* VAL1(R) VAL2(2.111) COMP(EQ)
     C                   EVAL      R = 4.222 / 2
      *
    MU* VAL1(R) VAL2(3.410) COMP(EQ)
     C                   EVAL      R = 6.820 / 2
      *
    MU* VAL1(R) VAL2(3.400) COMP(EQ)
     C                   EVAL      R = 6.800 / 2
      *
    MU* VAL1(R) VAL2(3.750) COMP(EQ)
     C                   EVAL      R = 7.500 / 2
      *
    MU* VAL1(R) VAL2(3.409) COMP(EQ)
     C                   EVAL      R = 7.500 / 2.2
      *
    MU* VAL1(R) VAL2(3.125) COMP(EQ)
     C                   EVAL      R = 7.500 / 2.4
      *
    MU* VAL1(R) VAL2(0.925) COMP(EQ)
     C                   EVAL      R = 7.500 / 8.1
      *
    MU* VAL1(R) VAL2(33.333) COMP(EQ)
     C                   EVAL      R = 100.000 / 3
      *
    MU* VAL1(R) VAL2(3.000) COMP(EQ)
     C                   EVAL      R = 10 - 2 - 4 + 3 - 4
      *
    MU* VAL1(R) VAL2(-17.000) COMP(EQ)
     C                   EVAL      R = - 10 - 2 - 4 + 3 - 4
      *
    MU* VAL1(R) VAL2(3.750) COMP(EQ)
     C                   EVAL      R = 10 * 2 / 4 * 3 / 4
      *
    MU* VAL1(R) VAL2(21.500) COMP(EQ)
     C                   EVAL      R = 10 - 2 / 4 + 3 * 4
      *
    MU* VAL1(R) VAL2(14.000) COMP(EQ)
     C                   EVAL      R = 10 - 32 / 4 + 3 * 4
      *
    MU* VAL1(R) VAL2(9.750) COMP(EQ)
     C                   EVAL      R = 10 - 2 + 1 + 3 / 4
      *
    MU* VAL1(R) VAL2(8.750) COMP(EQ)
     C                   EVAL      R = 10 - 2 * 1 + 3 / 4
      *
    MU* VAL1(R) VAL2(7.000) COMP(EQ)
     C                   EVAL      R = 10 - 2 + 1 * 3 - 4
      *
    MU* VAL1(R) VAL2(-3.000) COMP(EQ)
     C                   EVAL      R = 10 - 2 + 1 - 3 * 4
      *
    MU* VAL1(R) VAL2(19.250) COMP(EQ)
     C                   EVAL      R = 10 * 2 / 1 - 3 / 4
      *
    MU* VAL1(R) VAL2(7.500) COMP(EQ)
     C                   EVAL      R = 10 * -2 / -1 * - 3 / 4 / - 2
      *
    MU* VAL1(R) VAL2(-200.378) COMP(EQ)
     C                   EVAL      R = 10 * -2.3 / - 1 * - 3.4 /
     C                                 0.4 - 1 * - 3 / - 2 * 5.2 -
     C                                 9 * -0.1 * 9.3 / -5.1 *
     C                                 -0.89 * 2
      *
     C                   SETON                                        LR