     D AR              S              3  0 DIM(10)
    MU* VAL1(AR(1)) VAL2(4) COMP(NE)
     C                   EVAL      AR(1) = 5
     C                   SETON                                        LR
