     V*=====================================================================
     V* MODIFICHE Ril.  T Au Descrizione
     V* gg/mm/aa  nn.mm i xx Breve descrizione
     V*=====================================================================
     V* 18/02/20  001577  BMA Creazione
     V*=====================================================================
      *---------------------------------------------------------------
      *---------------------------------------------------------------
     D* M A I N
      *---------------------------------------------------------------
     D AAA010          S             10     INZ('PIPPO')
     C   50              DSPLY                   AAA010
     C                   SETON                                        LR
      *---------------------------------------------------------------
