     V*=====================================================================
     V* MODIFICHE Ril.  T Au Descrizione
     V* gg/mm/aa  nn.mm i xx Breve descrizione
     V*=====================================================================
     V* 18/02/20  001577  BMA Creazione
     V*=====================================================================
      *---------------------------------------------------------------
      *---------------------------------------------------------------
     D* M A I N
      *---------------------------------------------------------------
    MU* VAL1(*IN50) VAL2('1') COMP(EQ)
    MU* VAL1(*IN51) VAL2('1') COMP(EQ)
    MU* VAL1(*IN52) VAL2('1') COMP(EQ)
     C                   SETON                                        505152
    MU* VAL1(*IN50) VAL2('0') COMP(EQ)
    MU* VAL1(*IN51) VAL2('0') COMP(EQ)
    MU* VAL1(*IN52) VAL2('0') COMP(EQ)
     C                   SETOFF                                       505152
    MU* VAL1(*IN80) VAL2('1') COMP(EQ)
     C                   EVAL      *IN80=*ON
    MU* VAL1(*IN80) VAL2('0') COMP(EQ)
     C                   EVAL      *IN80=*OFF
      *
     C                   SETON                                        LR
      *---------------------------------------------------------------
