      *---------------------------------------------------------------
      * A very simple procedure
      *---------------------------------------------------------------
     DCALL1            PR
      *---------------------------------------------------------------
      * Main
      *---------------------------------------------------------------
     C                   CALLP     CALL1()
      *
     C                   SETON                                        LR
      *---------------------------------------------------------------
     PCALL1            B
     DCALL1            PI
     C     'Procedure!'  DSPLY
     PCALL1            E
      *---------------------------------------------------------------