      *---------------------------------------------------------------
      * A very simple procedure
      *---------------------------------------------------------------
     DCALL1            PR
      *---------------------------------------------------------------
      * Main
      *---------------------------------------------------------------
    MU* VAL1(*IN50) VAL2('1') COMP(EQ)
     C                   SETON                                        50
      *
     C*                   CALLP     CALL1()
      *
     C                   SETON                                        LR
      *---------------------------------------------------------------
     PCALL1            B
     DCALL1            PI
     C     'Procedure1'  DSPLY
     C     'Procedure2'  DSPLY
     PCALL1            E
      *---------------------------------------------------------------
