    MU* TIMEOUT(1)
     D MILLIS          S              9  0 INZ(10)
      *
     C                   CALL      'Sleep'
     C                   PARM                    MILLIS
    MU* TIMEOUT(234)
     C                   SETON                                        LR
