     DA                S              8  0 INZ(5)
     DB                S              8  0 INZ(8)
     D RESULT          S              8  0 INZ(0)
      *
     C                   IF        1=2
    MU* FAIL('This code should not be executed')
     C     ''            DSPLY
     C                   ENDIF
     C                   SETON                                        LR
