     D ppdat           S              8
     C     *entry        plist
     C                   parm                    ppdat
      *
     C                   call      'CALCFIB'
     C                   parm                    ppdat             8
     C                   seton                                        lr
      *--------------------------------------------------------------*