     FADD01V    CF   E             WORKSTN USROPN
     C     PGMCTL        DOWEQ      0
     C                   EXFMT      CALC01
     C                   EVAL       RESULT=A+B      
     C                   ENDDO
