      *----------------------------------------------------------------------
     D A1              S              2  0
     D A2              S              2  0
     D RESULT          S              2  0
      *----------------------------------------------------------------------
      *----------------------------------------------------------------------
     C     *ENTRY        PLIST
     C                   PARM                    A1
     C                   PARM                    A2
     C                   PARM                    RESULT
      *----------------------------------------------------------------------
     C                   CALL      'OP_ADD'
     C                   PARM                    A1
     C                   PARM                    A2
     C                   PARM                    RESULT
     C     RESULT        DSPLY
      *----------------------------------------------------------------------
